<%@ page contentType="text/html;charset=UTF-8" %>
<html>
<head>
        <link href="${pageContext.request.contextPath}/css/bootstrap.min.css" rel="stylesheet">
        <link href="${pageContext.request.contextPath}/css/bootstrap-table.css" rel="stylesheet">
        <link href="${pageContext.request.contextPath}/css/simple-sidebar.css" rel="stylesheet">
        <link href="${pageContext.request.contextPath}/css/font-awesome.min.css" rel="stylesheet">
        <link href="${pageContext.request.contextPath}/css/index.css" rel="stylesheet">

        <link href="${pageContext.request.contextPath}/css/bootstrap-datetimepicker.min.css" rel="stylesheet" />

        <link href="<%=request.getContextPath()%>/css/bootstrap-select.min.css">

        <link href="${pageContext.request.contextPath}/css/top.css" rel="stylesheet" />

    <title>地域分析</title>
    <style type="text/css">
        .optionitems{
            height: 400px;
            overflow: scroll;
        }
        .btstp_table{
            height: 80%;
            overflow: scroll;
        }
        .chartDiv{
            height: 65%;
        }
        .tableDiv{
            height: 35%;
        }

    </style>

</head>
<body>
    <div class="topDiv" >
        <!--当前分析名称及介绍放置位置-->
        <div class="title" data-toggle="popover" title="分析介绍"  data-container="body" style="cursor: pointer;"
             data-toggle="popover" data-placement="bottom"
             data-content="分析每日用户增长趋势图，以折线形式展现">用户分析
                    <i class="fa fa-align-justify fa-fw"></i>

        </div>

        <div class="conditionDiv">
            <span class="rementDiv">选择时间：</span>
                <div class="form-group">
                    <!--指定 date标记-->
                    <div class='input-group date' id='datetimepicker1'>
                        <input type='text' class="form-control" id="datetimepickerVal1"/>
                        <span class="input-group-addon">
                    <span class="glyphicon glyphicon-calendar"></span>
                    </span>
                    </div>
                </div>
                <div class="form-group">
                    <!--指定 date标记-->
                    <div class='input-group date' id='datetimepicker2'>
                        <input type='text' class="form-control" id="datetimepickerVal2"/>
                        <span class="input-group-addon">
                    <span class="glyphicon glyphicon-calendar"></span>
                     </span>
                    </div>
                </div>
        </div>

        <div class="conditionDiv">
            <span class="rementDiv">区域：</span>
            <select    class="selectpicker show-tick show-menu-arrow" style="outline: none;width:200px;" data-live-search="true" id="select_article" >
                <option value="">请选择</option>
                <option value="安徽省">安徽省</option>
                <option value="澳门">澳门</option>
                <option value="北京市">北京市</option>
                <option value="重庆市">重庆市</option>
                <option value="福建省">福建省</option>
                <option value="甘肃省">甘肃省</option>
                <option value="广东省">广东省</option>
                <option value="广西壮族自治区">广西壮族自治区</option>
                <option value="贵州省">贵州省</option>
                <option value="海南省">海南省</option>
                <option value="黑龙江">黑龙江</option>
                <option value="河南省">河南省</option>
                <option value="湖北省">湖北省</option>
                <option value="河南省">湖南省</option>
                <option value="江苏省">江苏省</option>
                <option value="江西省">江西省</option>
                <option value="吉林省">吉林省</option>
                <option value="辽宁省">辽宁省</option>
                <option value="内蒙古自治区">内蒙古自治区</option>
                <option value="宁夏回族自治区">宁夏回族自治区</option>
                <option value="青海省">青海省</option>
                <option value="山东省">山东省</option>
                <option value="陕西省">陕西省</option>
                <option value="山西省">山西省</option>
                <option value="四川省">四川省</option>
                <option value="天津市">天津市</option>
                <option value="香港">香港</option>
                <option value="新疆维吾尔自治区">新疆维吾尔自治区</option>
                <option value="西藏自治区">西藏自治区</option>
                <option value="云南省">云南省</option>
                <option value="浙江省">浙江省</option>
                <option value="上海市">上海市</option>
                <option value="河北省">河北省</option>
            </select>

        </div>



    </div>
    <div class="contentDiv">
        <div class="chartDiv" id="main" ></div>

        <div class="tableDiv">

            <table id="table1"></table>
        </div>
        <div id="toolbar">toolbar</div>
    </div>
    <%--<script src="${pageContext.request.contextPath}/js/top.js"></script>--%>

    <script src="${pageContext.request.contextPath}/js/jquery.js"></script>
    <script src="${pageContext.request.contextPath}/js/bootstrap.js"></script>
    <script src="${pageContext.request.contextPath}/js/bootstrap-table.js"></script>
    <script src="${pageContext.request.contextPath}/js/bootstrap-table-zh-CN.js"></script>
    <script src="${pageContext.request.contextPath}/js/sidebar_menu.js"></script>
    <script src="${pageContext.request.contextPath}/js/slimscroll/jquery.slimscroll.min.js"></script>
    <script src="${pageContext.request.contextPath}/js/layer/layer.min.js"></script>
    <script src="${pageContext.request.contextPath}/js/contabs.js"></script>
    <script src="${pageContext.request.contextPath}/js/json/china.json"></script>

    <!--bootstrap下拉框-->
    <script src="<%=request.getContextPath()%>/js/bootstrap-select.js"></script>

    <!--bootstrap时间控件-->
    <script src="${pageContext.request.contextPath}/js/bootstrap-datetimepicker.min.js"></script>
    <script src="${pageContext.request.contextPath}/js/locales/bootstrap-datetimepicker.zh-CN.js"></script>

    <script type="text/javascript" src="${pageContext.request.contextPath}/js/echarts.js"></script>

    <!-- bootstrap-table.min.js -->
    <%--<script src="https://cdn.bootcss.com/bootstrap-table/1.11.1/bootstrap-table.min.js"></script>--%>
    <script type="text/javascript">
        $(function () {

            $('#select_article').selectpicker({
                noneSelectedText: '请选择',

                liveSearch: true,
                size:40,
                showIcon:false
            });

            // 时间控件的 change 事件
            $('#datetimepickerVal2').change(function () {
                // string 类型
                var startDate = $('#datetimepickerVal1').val();
                var endDate = $('#datetimepickerVal2').val();
                var provinceName = $('#select_article').val();  //string
                if (startDate != "" && endDate != "" && provinceName != ""){
                    if ( Date.parse(startDate)-Date.parse(endDate) < 0){
                        $('#table1').bootstrapTable('refresh',
                            {url: '<%=request.getContextPath()%>/cusertimeprov?provinceName=' +
                                provinceName + '&startDate='+startDate+'&endDate='+endDate});
                    }
                }
                if (startDate != "" && endDate != "" && provinceName == ""){
                    if ( Date.parse(startDate)-Date.parse(endDate) < 0){
                        $('#table1').bootstrapTable('refresh',
                            {url: '${pageContext.request.contextPath}/userpbetweendate?startDate='+startDate+'&endDate='+endDate});

                    }
                }
            })



            // 下拉框的change事件。。。。
            $("#select_article").on('changed.bs.select',function(){
                var startDate = $('#datetimepickerVal1').val();
                var endDate = $('#datetimepickerVal2').val();
                var provinceName = $('#select_article').val();  //string
                //如果时间段是null，，查询所有的用户
                if(startDate == "" && endDate == "") {
                    var targetProvince = $("#select_article").selectpicker('val');
                    $('#table1').bootstrapTable('refresh', {url: '<%=request.getContextPath()%>/cityusersTable?provinceName=' + targetProvince});
                }

                if (startDate != "" && endDate != "" && provinceName != ""){
                    if ( Date.parse(startDate)-Date.parse(endDate) < 0){
                        $('#table1').bootstrapTable('refresh',
                            {url: '<%=request.getContextPath()%>/cusertimeprov?provinceName=' +
                                provinceName + '&startDate='+startDate+'&endDate='+endDate});
                    }
                }
            })





            $("[data-toggle='popover']").popover();

            $('#datetimepicker1').datetimepicker({
                language:  "zh-CN",
                weekStart: 1,
                todayBtn:  1,
                todayHighlight: 1,
                startView: 2,
                forceParse: 0,
                showMeridian: 1,
                format: 'yyyy-mm-dd',
                autoclose: true,
                minView: "month", //选择日期后，不会再跳转去选择时分秒
            }).on("click",function(){
                var endVal = $("#datetimepickerVal2").val();
                $("#datetimepicker1").datetimepicker("setEndDate",endVal);
            });

            $('#datetimepicker2').datetimepicker({
                language:  "zh-CN",
                weekStart: 1,
                todayBtn:  1,
                todayHighlight: 1,
                startView: 2,
                forceParse: 0,
                showMeridian: 1,
                format: 'yyyy-mm-dd',
                autoclose: true,
                minView: "month", //选择日期后，不会再跳转去选择时分秒
            }).on("click",function(){
                var startVal = $("#datetimepickerVal1").val();
                $("#datetimepicker2").datetimepicker("setStartDate",startVal);
            });



            $(".conditionDiv select").hide();//隐藏bootstrap select的原始下拉框

            initTable();

            initChart();

            $('ul[role="listbox"]').addClass('optionitems');
            $('.bootstrap-table').addClass('btstp_table');

        });

        // 初始化echarts
        function initChart() {
            // // 基于准备好的dom，初始化echarts实例
            // var myChart = echarts.init(document.getElementById('main'));
            var anhui = "../js/json/anhui.json";
            // var china = "../js/json/china.json";
            var china = "../js/json/china.json";
            var aomen = "../js/json/aomen.json";
            var beijing = "../js/json/beijing.json";
            var chongqing = "../js/json/chongqing.json";
            var fujian = "../js/json/fujian.json";
            var gansu = "../js/json/gansu.json";
            var guangdong = "../js/json/guangdong.json";
            var guangxi = "../js/json/guangxi.json";
            var guizhou = "../js/json/guizhou.json";
            var hainan = "../js/json/hainan.json";
            var hebei = "../js/json/hebei.json";
            var heilongjiang = "../js/json/heilongjiang.json";
            var henan = "../js/json/henan.json";
            var hubei = "../js/json/hubei.json";
            var hunan = "../js/json/hunan.json";
            var jiangsu = "../js/json/jiangsu.json";
            var jiangxi = "../js/json/jiangxi.json";
            var jilin = "../js/json/jilin.json";
            var liaoning = "../js/json/liaoning.json";
            var neimenggu = "../js/json/neimenggu.json";
            var ningxia = "../js/json/ningxia.json";
            var qinghai = "../js/json/qinghai.json";
            var shandong = "../js/json/shandong.json";
            var shanghai = "../js/json/shanghai.json";
            var shanxi = "../js/json/shanxi.json";
            var shanxi1 = "../js/json/shanxi1.json";
            var sichuan = "../js/json/sichuan.json";
            var tianjin = "../js/json/tianjin.json";
            var xianggang = "../js/json/xianggang.json";
            var xinjiang = "../js/json/xinjiang.json";
            var xizang = "../js/json/xizang.json";
            var yunnan = "../js/json/yunnan.json";
            var zhejiang = "../js/json/zhejiang.json";
            echarts.extendsMap = function(id, opt){
                // echarts实例
                var chart = this.init(document.getElementById('main'));
                var curGeoJson = {};

                //城市对应的 地图json
                var cityMap = {
                    "安徽省": anhui,
                    "澳门": aomen,
                    "北京市": beijing,
                    "重庆市": chongqing,
                    "福建省": fujian,
                    "甘肃省": gansu,
                    "广东省": guangdong,
                    "广西壮族自治区": guangxi,
                    "贵州省": guizhou,
                    "海南省": hainan,
                    "黑龙江": heilongjiang,
                    "河南省": henan,
                    "湖北省": hubei,
                    "湖南省": hunan,
                    "江苏省": jiangsu,
                    "江西省": jiangxi,
                    "吉林省": jilin,
                    "辽宁省": liaoning,
                    "内蒙古自治区": neimenggu,
                    "宁夏回族自治区": ningxia,
                    "青海省": qinghai,
                    "山东省": shandong,
                    "陕西省": shanxi1,
                    "山西省": shanxi,
                    "四川省": sichuan,
                    "天津市": tianjin,
                    "香港": xianggang,
                    "新疆维吾尔自治区": xinjiang,
                    "西藏自治区": xizang,
                    "云南省": yunnan,
                    "浙江省": zhejiang,
                    "上海市": shanghai,
                    "河北省": hebei
                };

                //地理位置
                var geoCoordMap = {"北京市": [116.46,39.92], "上海市": [121.48,31.22], "天津市": [117.2,39.13 ], "重庆市": [106.54,29.59], "河北省": [114.48,38.03], "山西省": [112.53,37.87], "辽宁省": [123.38,41.8 ], "吉林省": [125.35,43.88], "黑龙江": [126.63,45.75], "浙江省": [120.19,30.26], "福建省": [119.3,26.08 ], "山东省": [106.54,29.59], "河南省": [113.65,34.76], "湖北省": [114.31,30.52], "湖南省": [113,28.21], "广东省": [113.23,23.16], "海南省": [110.35,20.02], "四川省": [104.06,30.67], "贵州省": [106.71,26.57], "云南省": [102.73,25.04], "江西省": [115.89,28.68], "陕西省": [108.95,34.27], "青海省": [101.74,36.56], "甘肃省": [103.73,36.03], "广西壮族自治区": [106.54,29.59], "新疆维吾尔自治区": [87.68,43.77], "内蒙古自治区": [111.65,40.82], "西藏自治区": [91.11,29.97], "宁夏回族自治区": [106.27,38.47], "台湾 ":[121.5,25.14], "香港 ":[114.1,22.2], "澳门 ":[113.33,22.13], "安徽省": [117.27,31.86], "江苏省": [118.78,32.04],
                    "北京":[116.46, 39.92], "平谷":[117.1, 40.13], "密云":[116.85, 40.37], "顺义":[116.65, 40.13], "通县":[116.67, 39.92], "怀柔":[116.62, 40.32], "大兴":[116.33, 39.73], "房山":[115.98, 39.72], "延庆":[115.97, 40.47], "昌平":[116.2, 40.22],
                    "沈阳市":[123.38, 41.8], "新民市":[122.83, 42], "辽中市":[122.7, 41.52], "大连市":[121.62, 38.92], "金县市":[121.7, 39.13], "复县市":[121.97, 39.63], "新金市":[121.95, 39.55], "庄河市":[22.97, 39.7], "长海市":[122.58, 39.28], "鞍山市":[122.85, 41.12], "海城市":[122.75, 40.85], "台安市":[122.4, 41.4], "抚顺市":[123.97, 41.97], "新宾市":[125.02, 41.72], "清原市":[124.9, 42.13], "本溪市":[123.73, 41.3], "垣仁市":[125.33, 41.28], "锦州市":[121.15, 41.13], "锦县市":[121.35, 41.17], "义县市":[121.22, 41.55], "黑山市":[122.12, 41.7], "北镇市":[121.8, 41.6], "锦西市":[120.83, 40.77], "兴城市":[120.68, 40.63], "绥中市":[120.32, 40.35], "丹东市":[124.37, 40.13], "东沟市":[124.13, 39.97], "岫岩市":[123.25, 40.3], "凤城市":[124.05, 40.47], "宽甸市":[124.77, 40.75], "阜新市":[121.65, 42], "彰武市":[122.52, 42.42], "营口市":[122.18, 40.65], "盖县市":[122.37, 40.42], "盘山市":[122.03, 41.02], "大洼市":[122.06, 41], "辽阳市":[123.17, 41.28], "灯塔市":[123.34, 41.43], "铁岭市":[123.85, 42.32], "开原市":[124.03, 42.53], "昌图市":[124.13, 42.8], "铁法市":[123.5, 42.48], "康平市":[123.33, 42.75], "法库市":[123.37, 42.52], "西丰市":[124.7, 42.77], "朝阳市":[120.42, 41.58], "建昌市":[119.78, 40.82], "北票市":[120.75, 41.82], "凌源市":[119.37, 41.27], "建平市":[119.63, 41.38],

                    "上海":[121.48, 31.22],"嘉定":[121.24, 31.4],"宝山":[121.48, 31.41],"川沙":[121.7, 31.19],"南汇":[121.76, 31.05],"奉贤":[121.46, 30.92],"松江":[121.24, 31],"金山":[121.16, 30.89],"青浦":[121.1, 31.15],"崇明":[121.4, 31.73],

                    "天津":[117.2, 39.13],"宁河":[117.83, 39.33],"静海":[116.92, 38.93],"蓟县":[117.4, 40.05],"宝坻":[117.3, 39.75],"武清":[117.05, 39.4],

                    "重庆":[106.54, 29.59],"綦江":[106.56, 29.41],"长寿":[106.64, 29.01],"南桐":[107.04, 29.86],"合川":[106.28, 29.26],"潼南":[106.22, 30.03],"铜梁":[105.8, 30.16],"壁山":[106.03, 29.86],"荣昌":[106.21, 29.62],"大足":[105.59, 29.4],"永川":[105.71, 29.75],"万盛":[105.91, 29.38],

                    "石家庄市":[114.48, 38.03],"唐山市":[118.02, 39.63],"行唐市":[114.54, 38.42],"灵寿市":[114.38, 38.31],"束鹿市":[115.18, 37.94],"晋县市":[115.03, 38.03],"藁城市":[114.84, 38.03],"高邑市":[114.58, 37.62],"赵县市":[114.78, 37.76],"井陉市":[114.13, 38.03],"获鹿市":[114.03, 38.08],"新乐市":[114.67, 38.33],"正定市":[114.56, 38.13],"深泽市":[115.2, 38.2],"无极市":[114.96, 38.16],"赞皇市":[114.35, 37.65],"元氏市":[114.5, 37.74],"栾城市":[114.64, 38.87],"平山市":[114.24, 38.2],"邯郸市":[114.47, 36.6],"永年市":[114.5, 36.77],"曲周市":[114.92, 36.78],"馆陶市":[115.4, 36.47],"魏县市":[114.94, 36.37],"成安市":[114.68, 36.43],"大名市":[115.14, 36.28],"涉县市":[113.67, 36.57],"鸡泽市":[113.85, 36.95],"丘县市":[115.18, 36.84],"广平市":[114.94, 36.49],"肥乡市":[114.8, 36.56],"临漳市":[114.62, 36.35],"磁县市":[114.37, 36.37],"武安市":[114.2, 36.7],"邢台市":[114.48, 37.05],"柏乡市":[114.68, 37.49],"宁普市":[114.9, 37.62],"隆尧市":[114.75, 37.35],"临西市":[115.5, 36.87],"南官市":[115.37, 37.37],"巨鹿市":[115.03, 37.22],"任县市":[114.68, 37.11],"沙河市":[114.52, 36.94],"临城市":[114.5, 37.43],"内丘市":[114.5, 37.28],"新河市":[115.22, 37.53],"清河市":[115.67, 37.07],"威县市":[115.08, 36.97],"广宗市":[115.14, 37.06],"平乡市":[115.02, 37.06],"南和市":[114.71, 37],"保定市":[115.48, 38.85],"涞水市":[115.71, 39.39],"涿县市":[115.98, 39.48],"定兴市":[115.78, 39.28],"容城市":[115.86, 39.06],"安新市":[115.92, 38.92],"蠡县市":[115.58, 38.49],"博野市":[115.46, 38.46],"定县市":[114.02, 38.52],"阜平市":[114.18, 38.85],"唐县市":[114.97, 38.75],"涞源市":[114.67, 39.37],"易县市":[115.49, 39.35],"新城市":[115.84, 39.34],"雄县市":[116.1, 38.98],"徐水市":[115.65, 39.02],"高阳市":[115.78, 38.68],"安国市":[115.3, 38.41],"清苑市":[115.47, 38.76],"望都市":[115.14, 38.71],"曲阳市":[114.68, 38.62],"完县市":[115.12, 38.84],"满城市":[115.45, 38.95],"张家口市":[114.87, 40.82],"康保市":[114.6, 41.87],"赤城市":[115.82, 40.92],"怀来市":[115.54, 40.4],"蔚县市":[114.53, 39.83],"宣化市":[115.03, 40.63],"张北市":[114.7, 41.15],"沽源市":[115.68, 41.68],"崇礼市":[115.25, 40.98],"涿鹿市":[115.2, 40.37],"阳原市":[114.15, 40.12],"怀安市":[114.38, 40.67],"尚义市":[113.95, 41.05],"万全市":[114.73, 40.84],"承德市":[117.93, 40.97],"围场市":[117.72, 41.95],"平泉市":[118.68, 41.02],"宽城市":[118.47, 40.62],"兴隆市":[117.48, 40.42],"滦平市":[117.53, 40.95],"隆化市":[117.7, 41.32],"青龙市":[118.93, 40.43],"丰宁市":[116.63, 41.2],"秦皇岛市":[119.57, 39.95],"迁西市":[118.3, 40.15],"迁安市":[118.69, 40.02],"昌黎市":[119.15, 39.72],"卢龙市":[118.85, 39.89],"滦南市":[118.67, 39.49],"玉田市":[117.9, 39.9],"唐海市":[118.54, 39.31],"遵化市":[117.97, 40.2],"抚宁市":[119.22, 39.88],"乐亭市":[118.9, 39.43],"滦县市":[118.73, 39.74],"丰南市":[118.1, 39.58],"丰润市":[118.13, 39.82],"廊坊市":[116.7, 39.53],"安次市":[116.69, 39.52],"三河市":[117.06, 39.97],"香河市":[117, 39.76],"霸县市":[116.38, 39.12],"固安市":[116.29, 39.44],"大城市":[116.63, 38.7],"文安市":[116.45, 38.87],"永清市":[116.48, 39.32],"大厂市":[116.98, 39.98],"沧州市":[116.83, 38.33],"黄骅市":[117.33, 38.4],"盐山市":[117.22, 38.07],"吴桥市":[116.37, 37.65],"东光市":[116.52, 37.89],"肃宁市":[115.82, 38.43],"河间市":[116.07, 38.45],"泊头市":[116.56, 38.08],"交河市":[116.27, 38.02],"青县市":[116.8, 38.58],"海兴市":[117.85, 38.17],"南皮市":[116.7, 38.05],"任丘市":[116.08, 38.72],"献县市":[116.12, 38.2],"孟村市":[117.1, 38.06],"衡水市":[115.72, 37.72],"饶阳市":[115.74, 38.24],"阜城市":[116.14, 37.87],"景县市":[116.26, 37.69],"枣强市":[115.72, 37.52],"深县市":[115.56, 38.02],"安平市":[115.5, 38.22],"武强市":[115.96, 38.03],"武邑市":[115.9, 37.81],"故城市":[115.96, 37.36],"冀县市":[115.56, 37.59],

                    "太原市":[112.53, 37.87],"阳曲市":[112.65, 38.05],"娄烦市":[111.78, 38.05],"清徐市":[112.33, 37.62],"大同市":[113.3, 40.12],"阳泉市":[113.57, 37.85],"长治市":[113.08, 36.18],"天镇市":[114.08, 40.42],"灵丘市":[114.2, 39.47],"怀仁市":[113.1, 39.82],"山阴市":[112.82, 39.52],"平鲁市":[112.12, 39.53],"右玉市":[112.33, 40.18],"阳高市":[113.72, 40.38],"广灵市":[113.27, 39.75],"浑源市":[113.68, 39.7],"应县市":[113.18, 39.58],"朔县市":[112.42, 39.32],"左云市":[112.67, 40.02],"忻县市":[112.7, 38.38],"代县市":[112.97, 39.07],"五台市":[113.32, 38.72],"静乐市":[111.9, 38.37],"保德市":[111.09, 38.01],"河曲市":[111.17, 39.38],"神池市":[112.17, 39.1],"原平市":[112.7, 38.73],"繁峙市":[113.28, 39.2],"定襄市":[112.95, 38.5],"岢岚市":[111.58, 38.7],"五寨市":[111.82, 38.93],"偏关市":[111.47, 39.45],"宁武市":[112.28, 39],"榆次市":[112.72, 37.68],"孟县市":[113.37, 38.01],"昔阳市":[113.68, 37.62],"左权市":[113.35, 37.07],"太谷市":[112.53, 37.42],"平遥市":[112.18, 37.2],"灵石市":[111.77, 36.83],"寿阳市":[113.17, 37.88],"平定市":[113.62, 37.79],"和顺市":[113.55, 37.33],"榆社市":[112.97, 37.08],"祁县市":[112.33, 37.36],"介休市":[111.88, 37.03],"离石市":[111.13, 37.53],"兴县市":[111.22, 38.47],"方由市":[111.24, 37.86],"岚县市":[111.62, 38.28],"交城市":[112.14, 37.55],"文水市":[112.02, 37.42],"汾阳市":[111.75, 37.27],"孝义市":[111.8, 37.12],"交口市":[111.2, 36.97],"石楼市":[110.83, 37],"中阳市":[111.17, 37.37],"临县市":[110.95, 37.95],"柳林市":[110.85, 37.45],"襄垣市":[113.02, 36.55],"黎城市":[113.4, 36.56],"壶关市":[113.23, 35.11],"高平市":[112.88, 35.48],"阳城市":[112.38, 35.84],"长子市":[112.87, 36.13],"沁源市":[112.32, 36.5],"潞城市":[113.22, 36.33],"武乡市":[112.83, 36.83],"平顺市":[113.43, 36.19],"陵川市":[113.27, 35.78],"晋城市":[112.83, 35.52],"沁水市":[112.15, 35.67],"屯留市":[112.87, 36.32],"沁县市":[112.68, 36.75],"临汾市":[111.5, 36.08],"汾西市":[111.53, 36.63],"安泽市":[112.2, 36.15],"古县市":[111.9, 36.29],"翼城市":[111.68, 35.73],"曲沃市":[111.33, 35.63],"吉县市":[110.65, 36.12],"大宁市":[110.72, 36.47],"侯马市":[111.45, 35.03],"永和市":[110.64, 36.62],"洪洞市":[111.68, 36.25],"霍县市":[111.72, 36.57],"浮山市":[111.83, 35.97],"襄汾市":[111.43, 35.86],"乡宁市":[110.8, 35.97],"蒲县市":[111.07, 36.42],"运城市":[110.97, 35.03],"闻喜市":[111.2, 35.37],"垣曲市":[111.63, 35.3],"芮城市":[110.68, 34.71],"临猗市":[110.78, 35.15],"新绛市":[111.22, 35.62],"河津市":[110.7, 35.58],"夏县市":[111.22, 35.12],"绛县市":[111.58, 35.48],"平陆市":[111.2, 34.12],"永济市":[110.42, 34.88],"万荣市":[110.83, 110.83],"稷山市":[110.97, 35.6],

                    "长春市":[125.35, 43.88],"吉林市":[126.57, 43.87],"农安市":[125.15, 44.45],"德惠市":[125.68, 44.52],"榆树市":[126.55, 44.83],"九台市":[126.83, 44.15],"双阳市":[125.68, 43.53],"永吉市":[126.57, 43.87],"舒兰市":[126.97, 44.4],"蛟河市":[127.33, 43.75],"桦甸市":[126.72, 42.97],"磐石市":[126.03, 42.93],"延吉市":[129.52, 42.93],"汪清市":[129.75, 43.32],"珲春市":[130.35, 42.85],"图们市":[129.83, 42.98],"和龙市":[129, 42.52],"安图市":[128.3, 42.58],"敦化市":[128.18, 43.35],"通化市":[125.92, 41.49],"柳河市":[125.7, 40.88],"海龙市":[125.65, 42.53],"辉南市":[126.03, 42.68],"靖宇市":[126.8, 42.38],"浑江市":[126.4, 41.97],"抚松市":[127.27, 42.33],"集安市":[126.17, 41.15],"长白市":[128.17, 41.43],"四平市":[124.37, 43.17],"梨树市":[124.33, 43.32],"怀德市":[124.82, 43.5],"伊通市":[125.32, 43.33],"辽源市":[125.15, 42.97],"东丰市":[125.5, 42.68],"双辽市":[123.5, 43.52],"白城市":[122.82, 45.63],"大安市":[124.18, 45.5],"扶余市":[124.82, 45.2],"乾安市":[124.02, 45],"长岭市":[123.97, 44.3],"通榆市":[123.13, 44.82],"洮安市":[122.75, 45.35],

                    "哈尔滨市":[126.63, 45.75],"齐齐哈尔市":[123.97, 47.33],"鹤岗市":[130.3, 47.33],"双鸭山市":[131.17, 46.65],"鸡四市":[130.97, 45.3],"大庆市":[125.03, 46.58],"伊春市":[128.92, 47.73],"嘉荫市":[130, 48.93],"铁力市":[128.08, 47.98],"绥化市":[127, 46.63],"绥棱市":[127.12, 47.22],"海伦市":[126.97, 47.47],"庆安市":[127.5, 46.87],"兰西市":[126.3, 46.28],"肇东市":[125.98, 46.07],"肇州市":[125.25, 45.72],"肇源市":[125.07, 45.53],"安达市":[125.33, 46.42],"明水市":[125.88, 47.18],"青岗市":[126.13, 46.68],"望奎市":[126.5, 46.83],"黑河市":[127.53, 50.22],"爱辉市":[127.53, 50.22],"德都市":[126.17, 48.5],"通北市":[126.8, 49.76],"北安市":[126.5, 48.22],"孙吴市":[127.5, 49.22],"逊克市":[128.42, 49.57],"嫩江市":[125.2, 49.17],"佳木斯市":[130.35, 46.83],"桦川市":[130.68, 47.02],"萝北市":[130.83, 47.58],"绥滨市":[131.83, 47.3],"富锦市":[132.02, 47.23],"同江市":[132.5, 47.67],"抚远市":[134.15, 48.33],"饶河市":[134, 46.78],"七台河市":[130.83, 45.82],"宝清市":[132.17, 46.33],"集贤市":[131.13, 46.7],"勃利市":[130.53, 45.75],"桦南市":[130.53, 46.25],"依兰市":[129.55, 46.33],"汤源市":[129.92, 46.73],"牡丹江市":[129.58, 44.6],"林口市":[130.23, 45.3],"鸡东市":[131.04, 45.27],"密山市":[131.85, 45.53],"虎林市":[133.97, 45.75],"绥芬河市":[131.17, 44.38],"东宁市":[131.12, 44.07],"穆棱市":[130.5, 44.9],"宁安市":[129.47, 44.35],"海林市":[129.35, 44.57],"阿城市":[126.95, 45.52],"呼兰市":[126.58, 46],"巴彦市":[127.38, 46.08],"宾县市":[127.48, 45.75],"木兰市":[128.03, 45.95],"通河市":[128.7, 45.98],"方正市":[128.8, 45.83],"延寿市":[128.35, 45.47],"尚志市":[127.95, 45.22],"五常市":[127.17, 44.93],"双城市":[126.32, 45.53],"富裕市":[124.4, 47.8],"讷河市":[124.85, 48.48],"克山市":[125.87, 48.03],"克东市":[126.22, 48.03],"拜泉市":[126.07, 47.62],"依安市":[125.3, 47.92],"林甸市":[124.87, 47.18],"泰来市":[123.45, 46.4],"龙江市":[123.18, 47.35],"甘南市":[123.48, 47.9],"杜尔伯特市":[124.44, 46.86],"加格达奇市":[124.07, 50.42],"呼玛市":[126.6, 51.72],"塔河市":[124.7, 52.32],"漠河市":[122.37, 53.48],

                    "杭州市":[120.19, 30.26],"余杭市":[120.3, 30.43],"富阳市":[119.95, 30.07],"建德市":[119.27, 29.49],"临安市":[119.72, 30.23],"萧山市":[120.25, 30.16],"桐庐市":[119.64, 29.8],"淳安市":[119.05, 29.61],"宁波市":[121.56, 29.86],"镇海市":[121.72, 29.96],"温州市":[120.65, 28.01],"瓯海市":[120.65, 28.01],"永喜市":[120.68, 28.16],"洞头市":[121.12, 27.84],"平阳市":[120.55, 27.68],"泰顺市":[119.7, 27.57],"乐清市":[120.94, 28.14],"瑞安市":[120.62, 27.8],"文成市":[120.08, 27.08],"苍南市":[120.36, 27.53],"湖州市":[120.1, 30.86],"平湖市":[121.02, 30.7],"桐乡市":[120.54, 30.64],"安吉市":[119.68, 30.68],"嘉善市":[120.92, 30.84],"嘉兴市":[120.76, 30.77],"海盐市":[120.92, 30.53],"海宁市":[120.69, 30.53],"德清市":[120.08, 30.54],"长兴市":[119.91, 30.01],"定海市":[122.11, 30.03],"岱山市":[122.2, 30.26],"嵊四市":[122.45, 30.72],"普陀市":[122.3, 29.97],"鄞县市":[121.56, 29.86],"象山市":[121.8, 29.48],"奉化市":[121.41, 29.66],"慈溪市":[121.23, 30.18],"宁海市":[121.42, 29.3],"余姚市":[121.16, 30.04],"绍兴市":[120.58, 30.01],"新昌市":[120.89, 29.49],"诸暨市":[120.23, 29.71],"上虞市":[120.87, 30.03],"嵊县市":[120.81, 29.6],"椒江市":[121.44, 28.67],"临海市":[121.13, 28.8],"三门市":[121.38, 29.11],"温岭市":[121.36, 28.36],"仙居市":[120.73, 28.85],"天台市":[121.03, 29.15],"黄岩市":[121.27, 28.64],"玉环市":[121.23, 28.14],"丽水市":[119.92, 28.45],"青田市":[120.28, 28.45],"庆无市":[119.06, 27.61],"遂昌市":[119.25, 28.59],"缙云市":[120.6, 28.66],"云和市":[119.56, 28.12],"龙泉市":[119.13, 28.08],"松阳市":[119.48, 28.46],"金华市":[119.64, 29.12],"浦江市":[119.88, 29.46],"东阳市":[120.23, 29.27],"武义市":[119.81, 28.9],"江山市":[118.61, 28.74],"开化市":[118.39, 29.15],"衢州市":[118.88, 28.97],"兰溪市":[119.48, 29.19],"义乌市":[120.06, 29.32],"永康市":[120.02, 28.92],"常山市":[118.5, 28.9],

                    "福州市":[119.3, 26.08],"闽侯市":[119.14, 26.16],"厦门市":[118.1, 24.46],"同安市":[118.15, 24.74],"南平市":[118.11, 27.34],"建瓯市":[118.32, 27.05],"浦城市":[118.55, 27.92],"邵武市":[117.48, 27.34],"顺昌市":[117.8, 26.8],"崇安市":[118.02, 27.76],"光泽市":[117.34, 27.54],"松溪市":[118.77, 27.53],"政和市":[118.85, 27.38],"宁德市":[119.52, 26.65],"福安市":[119.65, 27.09],"连江市":[119.53, 26.2],"福鼎市":[120.2, 27.34],"霞浦市":[120, 26.89],"吉田市":[118.74, 26.59],"罗源市":[119.55, 26.49],"寿宁市":[119.5, 27.47],"周宁市":[119.36, 27.12],"屏南市":[118.98, 26.92],"柘荣市":[119.89, 27.25],"莆田市":[119, 25.44],"仙游市":[118.7, 25.37],"福清市":[119.39, 25.73],"长乐市":[119.52, 25.96],"永泰市":[118.95, 25.88],"平潭市":[119.78, 25.51],"闽清市":[118.86, 26.21],"泉州市":[118.58, 24.93],"晋江市":[118.57, 24.82],"南安市":[118.39, 24.96],"惠安市":[118.78, 25.04],"安溪市":[118.18, 25.07],"永春市":[118.3, 25.34],"德化市":[118.24, 25.5],"金门市":[118.34, 24.43],"漳州市":[117.35, 24.52],"龙海市":[117.79, 24.44],"漳浦市":[117.61, 24.12],"诏安市":[117.16, 23.73],"平和市":[117.3, 24.38],"云霄市":[117.34, 23.99],"南靖市":[117.35, 24.51],"长泰市":[117.75, 24.62],"东山市":[117.4, 23.72],"华安市":[117.53, 25],"龙岩市":[117.01, 25.12],"上杭市":[116.41, 25.43],"永定市":[116.81, 24.76],"长汀市":[116.37, 25.85],"武平市":[116.1, 25.11],"连城市":[116.75, 25.72],"漳平市":[117.4, 25.3],"三明市":[117.61, 26.23],"龙溪市":[118.17, 26.18],"宁化市":[116.64, 26.26],"大田市":[117.83, 25.69],"永安市":[117.37, 25.97],"沙县市":[117.77, 26.41],"将乐市":[117.45, 26.73],"清流市":[116.81, 26.12],"建宁市":[116.82, 26.85],"泰宁市":[117.15, 26.92],"明溪市":[117.18, 26.36],

                    "济南市":[117, 36.65],"历城市":[117.07, 36.69],"长清市":[116.73, 36.55],"章丘市":[117.53, 36.72],"青岛市":[120.33, 36.07],"崂山市":[120.42, 36.15],"胶南市":[119.97, 35.88],"即墨市":[120.45, 36.38],"胶县市":[120, 36.28],"淄博市":[118.05, 36.78],"枣庄市":[117.57, 34.86],"滕县市":[117.17, 35.09],"东营市":[118.49, 37.46],"垦利市":[118.54, 37.59],"利津市":[118.25, 37.49],"德州市":[116.29, 37.45],"宁津市":[116.8, 37.64],"乐陵市":[117.22, 37.74],"商河市":[117.15, 37.31],"济阳市":[117.2, 36.97],"禹城市":[116.66, 36.95],"夏津市":[116, 36.95],"陵县市":[116.58, 37.34],"庆云市":[117.37, 37.37],"临邑市":[116.86, 37.2],"齐河市":[116.76, 36.79],"平原市":[116.44, 37.16],"武城市":[116.08, 37.2],"滨州市":[118.03, 37.36],"滨县市":[117.97, 37.47],"广饶市":[118.41, 37.04],"桓台市":[118.12, 36.95],"邹平市":[117.75, 36.89],"阳信市":[117.58, 37.65],"沾化市":[118.14, 37.7],"博兴市":[118.12, 37.12],"高青市":[117.66, 37.18],"惠民市":[117.51, 17.49],"无棣市":[117.58, 37.73],"潍坊市":[119.1, 36.62],"潍县市":[119.22, 36.77],"平度市":[119.97, 36.77],"诸城市":[119.42, 35.99],"安丘市":[119.2, 36.42],"临朐市":[118.53, 36.5],"寿光市":[118.73, 36.86],"昌邑市":[119.41, 36.86],"高密市":[119.75, 36.38],"五莲市":[119.2, 35.74],"昌乐市":[118.83, 36.69],"高都市":[118.47, 36.69],"烟台市":[121.39, 37.52],"牟平市":[121.59, 37.38],"文登市":[122.05, 37.2],"海阳市":[121.17, 36.76],"莱阳市":[120.71, 36.97],"栖霞市":[120.83, 37.28],"掖县市":[119.93, 37.18],"长岛市":[120.73, 37.91],"威海市":[122.1, 37.5],"福山市":[121.27, 37.49],"荣成市":[122.41, 37.16],"乳山市":[121.52, 36.89],"莱西市":[120.53, 36.86],"招远市":[120.38, 37.35],"黄县市":[120.51, 37.64],"蓬莱市":[120.75, 37.8],"临沂市":[118.35, 35.05],"沂水市":[118.64, 35.78],"日照市":[119.46, 35.42],"临沭市":[118.73, 34.89],"仓山市":[118.03, 34.84],"平邑市":[117.63, 35.49],"沂源市":[118.17, 36.18],"沂南市":[118.47, 35.54],"营县市":[118.83, 35.57],"莒南市":[118.83, 35.17],"郯城市":[118.35, 34.61],"费县市":[117.97, 35.26],"蒙阴市":[117.95, 35.7],"泰安市":[117.13, 36.18],"莱芜市":[117.67, 36.19],"肥城市":[116.76, 36.24],"平阴市":[116.46, 36.29],"新汶市":[117.67, 35.86],"新泰市":[117.76, 35.91],"宁阳市":[116.8, 35.76],"东平市":[116.3, 35.91],"济宁市":[116.59, 35.38],"兖州市":[116.83, 35.54],"泗水市":[117.27, 35.65],"鱼台市":[116.65, 35],"嘉祥市":[116.34, 35.41],"汶上市":[116.49, 35.71],"曲阜市":[116.98, 35.59],"邹县市":[116.97, 35.39],"微山市":[117.12, 34.8],"金乡市":[116.32, 35.07],"荷泽市":[115.43, 35.24],"郓城市":[115.94, 35.59],"巨野市":[116.08, 35.38],"单县市":[116.07, 34.82],"曹县市":[115.53, 34.83],"鄄城市":[115.5, 35.57],"梁山市":[116.1, 35.8],"成武市":[115.88, 34.97],"定陶市":[115.57, 35.07],"东明市":[115.08, 35.31],"聊城市":[115.97, 36.45],"高唐市":[116.23, 36.86],"东阿市":[116.23, 36.32],"莘县市":[115.67, 36.24],"临清市":[115.72, 36.68],"茌平市":[116.27, 36.58],"阳谷市":[115.78, 36.11],"冠县市":[115.45, 35.47],

                    "郑州市":[113.65, 34.76],"荥阳市":[113.35, 34.79],"开封市":[114.35, 34.79],"平顶山市":[113.29, 33.75],"洛阳市":[112.44, 34.7],"焦作市":[113.21, 35.24],"鹤壁市":[114.17, 35.9],"杞县市":[114.77, 34.56],"尉氏市":[114.17, 34.41],"新郑市":[113.71, 34.4],"登封市":[113.02, 34.46],"通许市":[114.46, 34.48],"中牟市":[114, 34.73],"密县市":[113.35, 34.51],"巩县市":[112.96, 34.76],"兰考市":[114.81, 34.69],"新乡市":[113.85, 35.31],"汲县市":[114.05, 35.44],"封丘市":[114.04, 35.03],"获嘉市":[113.63, 35.27],"温贺市":[113.06, 34.94],"济源市":[112.57, 35.08],"博爱市":[113.05, 35.16],"辉县市":[113.77, 35.46],"延津市":[114.19, 35.14],"原阳市":[113.96, 35.05],"武陟市":[113.38, 35.1],"沁阳市":[112.92, 35.08],"修武市":[113.42, 35.24],"安阳市":[114.35, 36.1],"南乐市":[115.21, 36.08],"范县市":[115.46, 35.9],"台前市":[115.83, 36],"滑县市":[114.52, 35.57],"浚县市":[114.54, 35.67],"淇县市":[114.17, 35.6],"内黄市":[114.88, 35.95],"清丰市":[115.1, 35.89],"濮阳市":[114.98, 35.71],"长垣市":[114.67, 35.19],"汤阴市":[114.35, 35.92],"林县市":[113.81, 36.06],"商丘市":[115.65, 34.44],"夏邑市":[116.13, 34.22],"柘城市":[115.29, 34.08],"睢县市":[115.04, 34.46],"虞城市":[115.87, 34.4],"永城市":[116.37, 33.94],"宁陵市":[115.31, 34.44],"民权市":[115.13, 34.65],"周口市":[114.63, 33.63],"商水市":[114.59, 33.54],"扶沟市":[114.38, 34.05],"鹿邑市":[115.48, 33.86],"淮阳市":[114.88, 33.74],"沈丘市":[115.06, 33.41],"西华市":[114.5, 33.79],"太康市":[114.85, 34.06],"郸城市":[115.17, 33.63],"项城市":[114.9, 33.44],"许昌市":[113.81, 34.02],"鄢县市":[114.17, 34.11],"郾城市":[113.98, 33.6],"襄城市":[113.46, 33.86],"鲁山市":[112.88, 33.74],"郏县市":[113.19, 33.98],"漯河市":[114.02, 33.56],"长葛市":[113.77, 34.22],"临颖市":[113.94, 33.81],"舞阳市":[113.58, 33.44],"叶县市":[113.35, 33.62],"宝丰市":[113.04, 33.86],"禹县市":[113.47, 34.16],"驻马店市":[114.02, 32.98],"确山市":[114.02, 32.83],"西平市":[114, 33.38],"汝南市":[114.35, 33],"新蔡市":[114.97, 32.75],"泌阳市":[113.31, 32.72],"遂平市":[113.98, 33.15],"上蔡市":[114.26, 33.25],"平舆市":[114.62, 32.97],"正阳市":[114.38, 32.62],"信阳市":[114.08, 32.13],"息县市":[114.72, 32.35],"固始市":[115.68, 32.17],"潢川市":[115.04, 32.13],"新县市":[114.83, 31.62],"罗山市":[114.53, 32.21],"淮滨市":[115.41, 32.44],"商城市":[115.42, 31.81],"光山市":[114.91, 32.02],"南阳市":[112.53, 33.01],"方城市":[112.98, 33.25],"唐河市":[112.83, 32.7],"新野市":[112.36, 32.51],"邓县市":[112.08, 32.68],"淅川市":[111.47, 33.14],"南召市":[112.4, 33.49],"社旗市":[112.92, 33.05],"桐柏市":[113.4, 32.37],"镇平市":[112.23, 33.03],"内乡市":[111.83, 33.05],"西峡市":[111.5, 33.31],"三门峡市":[111.19, 34.76],"孟津市":[112.42, 34.84],"临汝市":[112.83, 34.17],"汝阳市":[112.46, 34.16],"嵩县市":[112.07, 34.14],"栾川市":[111.6, 33.81],"灵宝市":[110.85, 34.52],"渑池市":[111.75, 34.76],"义马市":[111.92, 34.73],"偃师市":[112.77, 34.73],"伊川市":[112.42, 34.43],"宜阳市":[112.15, 34.51],"洛宁市":[111.65, 34.39],"卢氏市":[111.03, 34.06],"陕县市":[111.19, 34.76],"新安市":[112.14, 34.75],

                    "武汉市":[114.31, 30.52],"武昌市":[114.33, 30.35],"汉阳市":[114.02, 30.57],"黄石市":[115.09, 30.2],"十堰市":[110.79, 32.65],"沙市市":[112.24, 30.32],"宜昌市":[111.3, 30.7],"襄樊市":[112.14, 30.02],"孝感市":[113.91, 31.92],"黄陂市":[114.36, 30.88],"汉川市":[113.59, 30.63],"云梦市":[113.73, 31.02],"应山市":[113.81, 31.62],"大悟市":[114.09, 31.56],"应城市":[113.6, 30.94],"安陆市":[113.69, 31.25],"鄂城市":[114.87, 30.38],"黄冈市":[114.87, 30.44],"新洲市":[114.8, 31.84],"红安市":[114.61, 31.29],"麻城市":[115, 31.17],"罗川市":[115.37, 30.79],"浠水市":[115.22, 30.46],"蕲春市":[115.3, 30.24],"黄梅市":[115.93, 30.09],"广济市":[115.56, 29.85],"英山市":[115.57, 30.75],"咸宁市":[114.28, 29.87],"阳新市":[115.22, 29.83],"通山市":[114.52, 29.6],"通城市":[113.8, 29.23],"嘉鱼市":[113.91, 29.97],"崇阳市":[114.04, 29.54],"蒲圻市":[113.85, 29.71],"荆门市":[112.19, 31.02],"江陵市":[112.18, 30.35],"钟祥市":[112.58, 31.17],"京山市":[113.11, 31.03],"监利市":[112.9, 29.83],"石首市":[112.41, 29.73],

                    "长沙市":[113, 28.21],"望城市":[112.8, 28.37],"株洲市":[113.16, 27.83],"湘潭市":[112.91, 27.87],"衡阳市":[112.61, 26.89],"邵阳市":[111.5, 27.22],"岳阳市":[113.09, 29.37],"临湘市":[113.42, 29.48],"平江市":[113.56, 29.71],"泪罗市":[113.05, 28.8],"湘阴市":[112.87, 28.68],"华容市":[112.55, 29.52],"浏阳市":[113.63, 28.16],"醴陵市":[113.5, 27.67],"攸县市":[113.32, 27.01],"茶陵市":[113.54, 26.79],"酃县市":[113.77, 26.49],"湘乡市":[112.5, 27.75],"郴州市":[113, 25.79],"郴县市":[113, 25.79],"安仁市":[113.27, 26.71],"永兴市":[113.11, 26.13],"资兴市":[113.39, 25.95],"桂东市":[113.91, 25.08],"汝城市":[113.68, 25.54],"宜章市":[113.96, 25.41],"临武市":[112.55, 25.27],"嘉禾市":[112.35, 25.56],"桂阳市":[112.72, 25.73],"来阳市":[112.84, 26.41],"衡南市":[112.61, 26.89],"衡山市":[112.86, 27.25],"衡东市":[112.95, 27.1],"常宁市":[112.39, 26.38],"祁阳市":[111.85, 26.59],"祁东市":[112.14, 26.8],"永州市":[111.63, 26.22],"零陵市":[111.63, 26.22],"新田市":[112.21, 25.91],"宁远市":[111.95, 25.6],"蓝山市":[112.16, 25.37],"双牌市":[111.64, 25.96],"江永市":[111.33, 25.41],"道县市":[111.57, 25.52],"东安市":[111.28, 26.41],"江华市":[111.79, 24.97],"新宁市":[110.84, 26.44],"武冈市":[110.61, 26.73],"隆回市":[111.04, 27.13],"绥宁市":[110.14, 25.59],"洞口市":[110.57, 27.06],"城步市":[110.3, 26.37],"娄底市":[111.96, 27.71],"涟源市":[111.66, 27.68],"新邵市":[111.46, 27.33],"双峰市":[112.18, 27.44],"冷水江市":[111.41, 27.68],"邵东市":[111.73, 27.25],"新化市":[111.29, 27.73],"怀化市":[109.95, 27.52],"黔阳市":[110.14, 27.33],"辰溪市":[110.18, 28.02],"沅陵市":[110.39, 28.46],"溆浦市":[110.57, 27.92],"会同市":[109.71, 26.86],"靖县市":[109.68, 26.57],"芷江市":[109.78, 27.44],"麻阳市":[109.79, 27.87],"通道市":[109.77, 26.16],"新晃市":[109.16, 27.37],"吉首市":[109.71, 28.3],"永顺市":[109.84, 29],"桑植市":[110.16, 29.38],"大庸市":[110.48, 29.13],"古丈市":[109.91, 28.62],"泸溪市":[110.73, 28.29],"凤凰市":[109.43, 27.92],"花垣市":[109.46, 28.59],"保靖市":[109.64, 28.7],"龙山市":[109.42, 29.64],"常德市":[111.69, 29.05],"临澧市":[111.64, 29.44],"澧县市":[111.75, 29.65],"安乡市":[112.16, 29.41],"津市市":[111.87, 29.64],"汉寿市":[111.97, 28.9],"桃源市":[111.47, 28.9],"慈利市":[111.09, 29.41],"石门市":[111.35, 29.59],"益阳市":[112.33, 28.6],"南县市":[112.39, 29.37],"沅江市":[112.36, 28.83],"宁乡市":[112.55, 28.27],"安化市":[111.2, 28.38],"桃江市":[112.11, 28.51],

                    "广州市":[113.23, 23.16],"花县市":[113.19, 23.4],"新十市":[114.2, 24.09],"增城市":[113.81, 23.13],"从化市":[113.55, 23.57],"龙门市":[114.25, 23.75],"番禺市":[113.36, 22.95],"海口市":[110.35, 20.02],"汕头市":[116.69, 23.39],"洪江市":[110.38, 21.2],"茂名市":[110.88, 21.68],"佛山市":[113.11, 23.05],"江门市":[113.06, 22.61],"深圳市":[114.07, 22.62],"宝安市":[113.85, 22.58],"珠海市":[113.52, 22.3],"韶关市":[113.62, 24.84],"曲江市":[113.58, 24.68],"乐昌市":[113.35, 25.14],"仁化市":[113.73, 25.11],"南雄市":[114.33, 25.14],"始兴市":[114.08, 24.78],"翁源市":[114.13, 24.36],"佛岗市":[113.52, 23.86],"英德市":[113.38, 24.17],"清远市":[113.01, 23.7],"阳山市":[112.65, 24.48],"连县市":[112.4, 24.77],"连山市":[112.07, 24.59],"连南市":[112.28, 24.77],"惠州市":[114.4, 23.09],"惠阳市":[114.4, 23.09],"博罗市":[114.28, 23.18],"河源市":[114.68, 23.73],"连平市":[114.48, 24.39],"和平市":[114.89, 24.45],"龙川市":[115.25, 24.09],"紫金市":[115.18, 23.64],"惠东市":[114.7, 22.97],"东莞市":[113.75, 23.04],"梅州市":[116.1, 24.55],"梅县市":[116.1, 24.55],"平远市":[117.9, 24.59],"蕉岭市":[116.18, 24.66],"大埔市":[116.7, 24.34],"丰顺市":[116.18, 23.78],"五华市":[115.75, 23.93],"兴宁市":[115.75, 24.15],"潮州市":[116.63, 23.68],"澄海市":[116.8, 23.48],"潮安市":[116.63, 23.68],"饶平市":[117.01, 23.7],"南澳市":[117.03, 23.44],"潮阳市":[116.61, 23.27],"惠来市":[116.29, 23.07],"陆丰市":[117.64, 22.95],"海丰市":[117.33, 22.98],"普宁市":[116.17, 23.29],"揭西市":[115.82, 23.45],"揭阳市":[116.35, 23.55],"南海市":[113.11, 23.05],"三水市":[112.89, 23.18],"顺德市":[113.24, 22.84],"中山市":[113.38, 22.52],"斗门市":[113.25, 22.2],"新会市":[113.02, 22.52],"鹤山市":[112.94, 22.76],"开平市":[112.68, 22.36],"台山市":[112.78, 22.27],"恩平市":[112.29, 22.21],"高明市":[112.76, 21.71],"廉江市":[110.27, 21.63],"化州市":[110.59, 21.64],"高州市":[110.83, 21.95],"信宜市":[110.9, 22.36],"阳春市":[111.78, 22.16],"阳江市":[111.95, 21.85],"电白市":[110.99, 21.52],"吴川市":[110.78, 21.43],"徐闻市":[110.17, 20.34],"海康市":[110.07, 20.91],"遂溪市":[110.24, 21.39],"肇庆市":[112.44, 23.05],"高要市":[112.44, 23.05],"怀集市":[112.18, 23.93],"广宁市":[112.43, 23.14],"四会市":[112.68, 23.36],"新兴市":[112.2, 22.68],"云浮市":[112.02, 22.93],"罗定市":[111.56, 22.77],"郁南市":[111.51, 23.23],"德庆市":[111.75, 23.15],"封开市":[111.48, 23.45],

                    "琼山市":[110.33, 19.98],"文昌市":[110.72, 19.61],"定安市":[110.31, 19.68],"琼海市":[110.46, 19.25],"万宁市":[110.39, 18.8],"屯昌市":[110.1, 19.36],"澄迈市":[110, 19.75],"儋县市":[109.57, 19.52],"临高市":[109.69, 19.91],"保亭市":[109.7, 18.64],"白沙市":[109.44, 19.23],"琼中市":[109.83, 19.05],"陵水市":[110.02, 18.48],"崖县市":[109.5, 18.25],"乐东市":[109.17, 18.73],"东方市":[108.64, 19.09],"昌江市":[109.03, 19.25],

                    "成都市":[104.06, 30.67],"金堂市":[104.32, 30.88],"双流市":[104.94, 30.57],"蒲江市":[103.29, 30.2],"郫县市":[103.86, 30.8],"新都市":[104.13, 30.82],"来易市":[102.15, 26.9],"盐边市":[101.56, 26.9],"温江市":[103.81, 30.97],"灌县市":[103.61, 31.04],"彭县市":[103.94, 30.99],"什邡市":[104.16, 31.13],"广汉市":[104.25, 30.99],"新津市":[103.78, 30.42],"邛崃市":[103.47, 30.42],"大邑市":[103.53, 30.58],"崇庆市":[103.69, 30.63],"绵阳市":[104.73, 31.48],"江油市":[104.7, 31.8],"青川市":[105.21, 32.59],"平武市":[104.52, 32.42],"光元市":[105.86, 32.44],"旺苍市":[106.33, 32.25],"剑阁市":[105.45, 32.03],"梓潼市":[105.16, 31.64],"三台市":[105.06, 31.1],"盐亭市":[105.35, 31.23],"射洪市":[105.31, 30.9],"遂宁市":[105.58, 30.52],"蓬溪市":[105.74, 30.78],"中江市":[104.68, 31.06],"德阳市":[104.37, 31.13],"绵竹市":[104.19, 31.32],"安县市":[104.41, 31.64],"北川市":[104.44, 31.89],"内江市":[105.04, 29.59],"乐至市":[105.02, 30.3],"安岳市":[105.3, 30.12],"威远市":[104.7, 29.57],"资中市":[104.85, 29.81],"资阳市":[104.6, 30.19],"简阳市":[104.53, 30.38],"隆昌市":[105.25, 29.64],"宜宾市":[104.56, 29.77],"富顺市":[104.97, 29.24],"南溪市":[104.96, 28.87],"江安市":[105.06, 28.71],"纳溪市":[105.38, 28.77],"泸县市":[105.46, 28.96],"合江市":[105.78, 28.79],"泸州市":[105.39, 28.91],"古蔺市":[105.79, 28.03],"叙水市":[105.44, 28.19],"长宁市":[104.91, 28.6],"兴文市":[105.06, 28.36],"琪县市":[104.81, 28.38],"高县市":[104.52, 28.4],"筠连市":[104.53, 28.16],"屏由市":[104.15, 28.68],"乐由市":[103.73, 29.59],"夹江市":[103.59, 29.75],"洪雅市":[103.38, 29.95],"丹棱市":[103.53, 30.04],"青神市":[103.81, 29.86],"眉由市":[103.81, 30.05],"彭由市":[103.83, 30.22],"井研市":[104.06, 29.67],"仁寿市":[104.09, 30],"犍为市":[103.93, 29.21],"沐川市":[103.98, 28.96],"娥眉市":[103.5, 29.62],"马边市":[103.53, 28.87],"峨边市":[103.25, 29.23],"金口市":[103.13, 29.24],"涪陵市":[107.36, 29.7],"垫江市":[107.34, 30.36],"丰都市":[107.7, 29.89],"石柱市":[108.13, 29.98],"秀山市":[108.97, 28.47],"西阳市":[108.75, 28.85],"黔江市":[108.81, 29.53],"彭水市":[108.19, 29.29],"武隆市":[108.72, 29.29],"南川市":[107.13, 29.15],"万县市":[108.35, 30.83],"开县市":[108.39, 31.23],"城口市":[108.67, 31.98],"巫溪市":[109.6, 31.42],"巫山市":[109.86, 31.1],"奉节市":[109.52, 31.06],"云阳市":[108.89, 30.99],"忠县市":[108.03, 30.33],"梁平市":[107.78, 30.66],"南允市":[106.06, 30.8],"苍溪市":[105.96, 31.75],"阆中市":[105.97, 31.75],"仪陇市":[106.38, 31.52],"南部市":[106.03, 31.34],"西允市":[105.84, 31.01],"营山市":[106.57, 31.07],"蓬安市":[106.44, 31.04],"广安市":[106.61, 30.48],"岳池市":[106.43, 30.55],"武胜市":[106.3, 30.38],"华云市":[106.74, 30.41],"达县市":[107.49, 31.23],"万源市":[108.06, 32.07],"宜汉市":[107.71, 31.39],"开江市":[107.87, 31.1],"邻水市":[106.91, 30.36],"大竹市":[107.21, 30.75],"渠县市":[106.94, 30.85],"南江市":[106.83, 32.36],"巴中市":[106.73, 31.86],"平昌市":[107.11, 31.59],"通江市":[108.24, 31.95],"百沙市":[108.18, 32],"雅安市":[102.97, 29.97],"芦山市":[102.91, 30.17],"名山市":[103.06, 30.09],"荣经市":[102.81, 29.79],"汉源市":[102.66, 29.4],"石棉市":[102.38, 29.21],"天全市":[102.78, 30.09],"宝兴市":[102.84, 30.36],"马尔康市":[102.22, 31.92],"红原市":[102.55, 31.79],"阿坝市":[101.72, 31.93],"若尔盖市":[102.94, 33.62],"黑水市":[102.95, 32.06],"松潘市":[103.61, 32.64],"南坪市":[104.19, 33.23],"汶川市":[103.61, 31.46],"理县市":[103.16, 31.42],"小金市":[102.34 , 30.97],"金川 市":[102.03, 31.48],"壤塘市":[100.97, 32.3],"茂汶市":[103.89, 31.67],"康定市":[101.95, 30.04],"炉霍市":[100.65, 31.38],"甘孜市":[99.96, 31.64],"新龙市":[100.28, 30.96],"白玉市":[98.83, 32.23],"德格市":[98.57, 31.81],"石渠市":[98.06, 33.01],"色达市":[100.35, 32.3],"泸定市":[102.25, 29.92],"丹巴市":[101.87, 30.85],"九龙市":[101.53, 29.01],"雅江市":[101, 30.03],"道孚市":[101.14, 30.99],"理塘市":[100.28, 30.03],"乡城市":[99.78, 28.93],"稻城市":[100.31, 29.04],"巴塘市":[99, 30],"得荣市":[99.25, 28.71],"西昌市":[102.29, 27.92],"昭觉市":[102.83, 28.03],"甘洛市":[102.74, 28.96],"雷波市":[103.62, 28.21],"宁南市":[102.76, 27.07],"会东市":[102.55, 26.74],"会理市":[102.21, 26.67],"德昌市":[102.15, 27.4],"美姑市":[103.14, 28.33],"金阳市":[103.22, 27.73],"布拖市":[102.8, 27.7],"普格市":[102.52, 27.38],"喜德市":[102.42, 28.33],"越西市":[102.49, 28.66],"盐源市":[101.51, 27.42],"冕宁市":[102.15, 28.58],"木里市":[101.25, 27.9],

                    "贵阳市":[106.71, 26.57],"六盘水市":[104.82, 26.58],"水城市":[104.82, 26.58],"盘县市":[104.64, 25.81],"六枝市":[105.47, 26.21],"遵义市":[106.9, 27.7],"绥阳市":[107.19, 27.95],"道真市":[107.6, 28.89],"凤冈市":[107.72, 27.97],"余庆市":[107.88, 27.22],"赤水市":[105.69, 28.57],"桐梓市":[106.8, 28.16],"正安市":[107.43, 28.56],"务川市":[107.87, 28.54],"湄潭市":[107.5, 27.76],"仁怀市":[106.41, 27.81],"习水市":[106.2, 28.33],"铜仁市":[109.21, 27.73],"玉屏市":[108.91, 27.24],"思南市":[108.23, 27.94],"德江市":[108.13, 28.27],"万山市":[109.2, 27.52],"江口市":[108.82, 27.68],"师阡市":[108.24, 27.52],"印江市":[108.41, 28.02],"沿河市":[108.48, 28.57],"松桃市":[109.18, 28.17],"毕节市":[105.29, 27.32],"黔西市":[106.04, 27.03],"织金市":[105.76, 26.66],"赫章市":[104.71, 27.13],"大方市":[105.61, 27.16],"金沙市":[106.22, 27.46],"钠雍市":[105.38, 26.77],"威宁市":[104.28, 26.87],"安顺市":[105.92, 26.25],"息烽市":[106.73, 27.1],"清镇市":[106.46, 26.56],"普定市":[105.75, 26.32],"开阳市":[106.95, 27.06],"修文市":[106.59, 26.84],"平坝市":[106.26, 26.42],"镇宁市":[105.75, 26.08],"紫云市":[106.06, 25.75],"关岭市":[105.62, 25.94],"兴义市":[104.91, 25.1],"普安市":[104.96, 25.79],"贞丰市":[105.63, 25.39],"望谟市":[106.09, 25.17],"册亭市":[105.79, 25],"安龙市":[105.49, 25.11],"兴仁市":[105.18, 25.44],"晴龙市":[105.21, 25.83],"凯里市":[107.97, 26.59],"施秉市":[108.11, 27.03],"镇远市":[108.41, 27.06],"天柱市":[109.2, 26.89],"剑河市":[108.58, 26.64],"黎平市":[109.14, 26.24],"从江市":[108.9, 25.76],"麻江市":[107.58, 26.49],"黄平市":[107.89, 26.89],"三穗市":[108.68, 26.98],"岑巩市":[108.72, 27.21],"锦屏市":[109.18, 26.7],"台江市":[108.32, 26.68],"榕江市":[108.5, 25.94],"雷山市":[108.07, 26.38],"丹寨市":[107.79, 26.21],"都匀市":[107.53, 26.72],"贵定市":[107.22, 26.58],"瓮安市":[107.48, 27.08],"平塘市":[107.55, 25.83],"长顺市":[106.45, 26.03],"惠水市":[106.66, 26.14],"荔波市":[107.88, 25.42],"福泉市":[107.51, 26.7],"独山市":[107.54, 25.84],"罗甸市":[106.74, 25.43],"龙里市":[106.98, 26.46],"三都市":[107.86, 26],

                    "昆明市":[102.73, 25.04],"富民市":[102.48, 25.21],"晋宁市":[102.58, 24.68],"呈贡市":[102.79, 24.9],"安宁市":[102.44, 24.95],"昭通市":[103.7, 29.32],"永善市":[103.63, 28.22],"大关市":[103.91, 27.74],"彝良市":[104.06, 27.61],"鲁甸市":[103.54, 27.21],"绥江市":[103.97, 28.58],"盐津市":[104.28, 28.08],"威信市":[105.05, 27.85],"镇雄市":[104.86, 27.42],"巧家市":[102.92, 26.9],"永富市":[104.38, 28.62],"曲靖市":[103.79, 25.51],"宣威市":[104.09, 26.24],"富源市":[104.24, 25.67],"师宗市":[103.97, 24.85],"嵩明市":[103.03, 25.35],"会泽市":[103.27, 26.41],"沽益市":[103.82, 25.62],"罗平市":[104.3, 24.88],"陆良市":[104.64, 25.04],"宜良市":[103.12, 24.9],"马龙市":[103.61, 25.41],"路南市":[103.24, 24.77],"寻甸市":[103.25, 25.56],"玉溪市":[102.52, 24.35],"华宁市":[102.93, 24.26],"通海市":[102.75, 24.09],"澄江市":[102.91, 24.68],"江川市":[102.73, 24.27],"易门市":[102.15, 24.67],"元江市":[102, 23.59],"新平市":[101.98, 24.06],"峨山市":[102.38, 24.16],"思茅市":[101, 22.79],"普洱市":[101.03, 23.07],"镇沅市":[100.88, 23.9],"景东市":[100.82, 24.42],"景谷市":[100.71, 23.5],"黑江市":[101.71, 23.4],"澜沦市":[99.97, 22.55],"西盟市":[99.47, 22.73],"江城市":[101.88, 22.58],"孟连市":[99.55, 22.32],"临沦市":[100.09, 23.88],"云县市":[100.12, 24.44],"镇康市":[99.02, 23.92],"永德市":[99.25, 24.03],"凤庆市":[99.92, 24.58],"双江市":[99.85, 23.45],"沧源市":[99.24, 23.15],"耿马市":[99.41, 23.56],"保由市":[99.18, 25.12],"施甸市":[99.15, 24.69],"腾冲市":[98.51, 25.01],"昌宁市":[99.61, 24.82],"龙陵市":[98.7, 24.58],"丽江市":[100.25, 26.86],"华坪市":[101.24, 26.63],"永胜市":[100.76, 26.71],"宁蒗市":[100.82, 27.29],"文山市":[104.24, 23.37],"广南市":[105.09, 24.05],"西畴市":[104.68, 23.42],"麻栗坡市":[104.71, 23.12],"马关市":[104.4, 23.01],"丘北市":[104.19, 24.03],"砚山市":[104.35, 23.62],"富宁市":[105.6, 23.62],"个旧市":[102.43, 23.35],"弥勒市":[103.43, 24.41],"蒙自市":[103.41, 23.36],"元阳市":[102.81, 23.17],"红河市":[102.42, 23.35],"石屏市":[102.48, 23.73],"泸西市":[103.76, 24.52],"金平市":[103.24, 22.77],"开远市":[103.23, 23.7],"绿春市":[102.42, 23.01],"建水市":[102.79, 23.64],"河口市":[103.98, 22.52],"屏边市":[103.67, 22.68],"景淇市":[100.79, 22],"勐海市":[100.5, 21.95],"勐腊市":[101.56, 21.48],"楚雄市":[101.54, 25.01],"元谋市":[101.85, 25.7],"武定市":[102.36, 25.55],"禄丰市":[102.08, 25.15],"南华市":[101.26, 25.21],"大姚市":[101.34, 25.73],"永仁市":[101.7, 26.07],"禄劝市":[102.45, 25.58],"牟定市":[101.58, 25.32],"双柏市":[101.67, 24.68],"姚安市":[101.24, 25.4],"下关市":[100.24, 25.45],"剑川市":[99.88, 26.53],"洱源市":[99.94, 26.1],"宾川市":[100.55, 25.82],"弥渡市":[100.52, 25.34],"永平市":[99.52, 25.45],"鹤庆市":[100.18, 26.55],"大理市":[100.19, 25.69],"漾濞市":[99.98, 25.68],"云龙市":[99.39, 25.9],"祥云市":[100.56, 25.48],"巍山市":[100.33, 25.23],"南涧市":[100.51, 25.04],"潞西市":[98.6, 24.41],"陇川市":[97.96, 24.33],"盈江市":[97.93, 24.69],"畹町市":[98.08, 24.08],"瑞丽市":[97.83, 24],"梁河市":[98.3, 24.78],"泸水市":[98.82, 25.97],"碧江市":[98.95, 26.55],"福贡市":[98.92, 26.89],"兰坪市":[99.29, 26.49],"贡山市":[98.65, 27.73],"中甸市":[99.72, 27.78],"德钦市":[98.93, 28.49],"维西市":[99.27, 27.15],

                    "南昌市":[115.89, 28.68],"新建市":[115.8, 28.69],"景德镇市":[117.22, 29.3],"萍乡市":[113.85, 27.6],"九江市":[115.97, 29.71],"彭泽市":[116.56, 29.9],"湖口市":[116.23, 29.75],"都昌市":[116.19, 29.29],"星子市":[116.03, 29.47],"永修市":[115.82, 29.04],"德安市":[115.75, 29.33],"瑞昌市":[115.65, 29.68],"武宁市":[115.09, 29.26],"修永市":[114.55, 29.04],"上饶市":[117.97, 28.47],"婺源市":[117.83, 29.25],"德兴市":[117.58, 28.96],"玉山市":[118.25, 28.68],"广丰市":[118.2, 28.45],"铅山市":[117.71, 28.32],"横峰市":[117.62, 28.42],"鹰潭市":[117.02, 28.23],"贵溪市":[117.2, 28.3],"余江市":[116.82, 28.22],"万年市":[117.08, 28.7],"乐平市":[117.12, 28.97],"波阳市":[116.68, 29],"于干市":[116.69, 28.7],"弋阳市":[117.43, 28.42],"宜春市":[114.38, 27.81],"万载市":[114.44, 28.11],"铜鼓市":[114.37, 28.53],"宜丰市":[114.78, 28.4],"上高市":[114.91, 28.25],"安义市":[115.55, 28.86],"奉新市":[115.38, 28.71],"高安市":[115.38, 28.42],"丰城市":[115.7, 28.19],"新余市":[114.92, 27.81],"分宜市":[114.68, 27.82],"靖安市":[115.37, 28.88],"抚州市":[116.34, 28],"临川市":[116.29, 27.95],"金溪市":[116.77, 27.92],"资溪市":[117.06, 27.7],"黎川市":[116.91, 27.3],"南丰市":[116.52, 27.22],"南城市":[116.62, 27.56],"宜黄市":[116.2, 27.55],"崇仁市":[116.05, 27.75],"乐安市":[115.82, 27.44],"东乡市":[116.61, 28.23],"进贤市":[116.26, 28.37],"吉安市":[114.97, 27.12],"新干市":[115.4, 27.77],"峡江市":[115.15, 27.56],"吉水市":[115.14, 27.22],"永丰市":[115.42, 27.33],"泰和市":[114.88, 26.81],"万安市":[114.77, 26.47],"遂川市":[114.5, 26.33],"宁冈市":[113.97, 26.71],"永新市":[114.23, 26.96],"莲花市":[113.94, 27.14],"安福市":[114.62, 27.39],"井冈山市":[114.17, 26.57],"赣州市":[114.92, 25.85],"广昌市":[116.32, 26.84],"石城市":[116.32, 26.34],"宁都市":[116, 26.46],"兴国市":[115.33, 26.32],"于都市":[115.39, 25.96],"瑞金市":[116.02, 25.89],"会昌市":[115.79, 25.58],"安远市":[115.41, 25.15],"寻乌市":[115.64, 24.96],"定南市":[115.02, 24.7],"龙南市":[114.79, 24.91],"全南市":[114.53, 24.76],"信丰市":[114.94, 25.39],"赣县市":[114.02, 25.85],"南康市":[114.75, 25.66],"上犹市":[114.55, 25.8],"崇义市":[114.31, 25.69],"大余市":[114.36, 25.39],

                    "西安市":[108.95, 34.27],"长安市":[108.97, 34.18],"铜川市":[109.11, 35.09],"耀县市":[108.98, 34.91],"宝鸡市":[107.15, 34.38],"凤翔市":[107.39, 34.53],"千阳市":[107.13, 34.65],"陇县市":[106.86, 34.91],"麟游市":[107.8, 34.69],"岐山市":[107.63, 34.46],"浮风市":[107.87, 34.38],"武功市":[108.22, 34.28],"眉县市":[107.76, 34.29],"太白市":[107.3, 34.09],"凤县市":[106.51, 33.93],"榆林市":[109.77, 38.3],"神木市":[110.51, 38.83],"府谷市":[111.07, 39.05],"佳县市":[110.48, 38.04],"米脂市":[110.23, 37.78],"吴堡市":[110.73, 37.49],"绥德市":[110.24, 37.49],"清涧市":[110.15, 37.11],"子洲市":[110.05, 37.45],"横山市":[109.32, 37.97],"靖边市":[108.79, 37.61],"定边市":[107.59, 37.6],"延安市":[109.47, 36.6],"安寨市":[109.34, 36.88],"子长市":[109.65, 37.16],"延川市":[110.18, 36.87],"延长市":[110.02, 36.59],"宜川市":[110.15, 36.04],"黄龙市":[109.86, 35.6],"洛川市":[109.42, 35.76],"宜君市":[109.11, 35.43],"黄陵市":[109.27, 35.6],"富县市":[109.37, 36],"甘泉市":[109.37, 36.29],"志丹市":[108.78, 36.84],"吴旗市":[108.22, 36.93],"咸阳市":[108.72, 34.36],"礼泉市":[108.43, 34.5],"永寿市":[108.14, 34.71],"彬县市":[108.09, 35.04],"长武市":[107.8, 35.22],"旬邑市":[108.33, 35.13],"淳化市":[108.57, 34.81],"泾阳市":[108.84, 34.53],"三原市":[108.94, 34.62],"高陵市":[109.1, 34.55],"户县市":[108.61, 34.12],"周至市":[108.22, 34.18],"兴平市":[108.49, 34.32],"乾县市":[108.25, 34.54],"渭南市":[109.5, 34.52],"蒲城市":[109.59, 34.97],"白水市":[109.6, 35.18],"成城市":[109.93, 35.2],"韩城市":[110.45, 35.47],"合阳市":[110.15, 35.24],"人荔市":[109.96, 34.82],"潼关市":[110.25, 34.56],"华阴市":[110.09, 34.58],"华县市":[109.77, 34.53],"蓝田市":[109.32, 34.17],"临潼市":[109.22, 34.38],"富平市":[109.17, 34.76],"商县市":[109.96, 33.88],"洛南市":[110.15, 34.11],"丹凤市":[110.35, 33.71],"商南市":[110.88, 33.54],"山阳市":[109.91, 33.55],"镇安市":[109.16, 33.45],"柞水市":[109.14, 33.69],"安康市":[109.02, 32.7],"旬阳市":[109.35, 32.83],"白河市":[110.06, 32.83],"平利市":[109.37, 32.41],"镇坪市":[109.51, 31.91],"岚皋市":[108.89, 32.3],"紫阳市":[108.55, 32.56],"汉阴市":[108.53, 32.9],"石泉市":[108.26, 33.05],"宁陕市":[108.33, 33.34],"汉中市":[108.04, 33.07],"留坝市":[106.95, 33.65],"城固市":[107.32, 33.16],"洋县市":[107.56, 33.23],"佛坪市":[108, 33.55],"西乡市":[107.77, 33],"镇巴市":[107.91, 32.56],"南郑市":[106.93, 33],"宁强市":[106.25, 32.82],"勉县市":[106.68, 33.16],"略阳市":[106.16, 33.34],

                    "西宁市":[101.74, 36.56],"大通市":[101.67, 36.92],"平安市":[102.09, 36.47],"湟中市":[101.57, 36.49],"乐都市":[102.38, 36.49],"民和市":[102.8, 36.3],"湟源市":[101.28, 36.72],"互助市":[101.95, 36.84],"化隆市":[102.3, 36.11],"循化市":[102.46, 35.84],"门源市":[101.62, 37.37],"海晏市":[100.99, 36.89],"刚察市":[100.17, 37.32],"祁连市":[100.22, 38.2],"同仁市":[102, 35.54],"尖扎市":[102, 35.92],"泽库市":[101.5, 35.03],"河南市":[101.62, 34.75],"共和市":[100.61, 36.27],"贵德市":[101.47, 36.02],"贵南市":[100.75, 35.57],"同德市":[100.63, 35.24],"兴海市":[99.99, 35.6],"玛沁市":[100.26, 34.49],"甘德市":[99.89, 33.95],"久治市":[101.47, 33.46],"班玛市":[100.73, 32.92],"达日市":[99.68, 33.74],"玛多市":[98.26, 34.92],"玉树市":[96.97, 33.03],"称多市":[97.12, 33.35],"囊谦市":[96.47, 32.23],"杂多市":[95.3, 32.92],"治多市":[95.6, 33.86],"曲麻菜市":[95.5, 34.52],"格尔木市":[94.9, 36.41],"乌兰市":[98.46, 36.9],"都兰市":[98.13, 36.3],"天峻市":[99.03, 37.28],

                    "兰州市":[103.73, 36.03],"永登市":[103.25, 36.73],"榆中市":[104.09, 35.87],"永昌市":[101.94, 38.23],"皋兰市":[103.97, 36.32],"定西市":[104.57, 35.57],"会宁市":[105.08, 35.72],"陇西市":[104.61, 34.98],"临洮市":[103.88, 35.39],"靖远市":[104.71, 36.54],"通渭市":[105.27, 35.24],"渭源市":[104.19, 35.17],"平凉市":[106.68, 35.51],"灵台市":[107.61, 35.1],"华亭市":[106.65, 35.21],"静宁市":[105.73, 35.51],"泾川市":[107.38, 35.31],"崇信市":[107.05, 35.27],"庄浪市":[106.06, 35.2],"庆阳市":[107.88, 36.03],"华池市":[108, 36.44],"庄宁市":[108.43, 35.5],"镇源市":[107.22, 35.7],"环县市":[107.33, 36.57],"合水市":[108.02, 35.81],"宁县市":[107.94, 35.17],"天水市":[105.69, 34.6],"徽县市":[106.11, 33.78],"礼县市":[105.15, 34.22],"武山市":[104.88, 34.69],"秦安市":[105.69, 34.89],"清水市":[106.12, 34.73],"两当市":[106.28, 33.9],"西和市":[105.28, 34.02],"甘谷市":[105.35, 34.7],"漳县市":[104.48, 34.87],"张家川市":[106.23, 35],"武都市":[104.94, 33.43],"宕昌市":[104.38, 34.06],"康县市":[105.58, 33.33],"成县市":[105.7, 33.75],"文县市":[104.7, 32.95],"临潭市":[103.35, 34.69],"舟曲市":[104.38, 33.81],"玛曲市":[102.04, 33.97],"下河市":[102.46, 35.21],"卓尼市":[103.54, 34.61],"迭部市":[103.23, 34.08],"碌曲市":[102.5, 34.6],"临夏市":[103.22, 35.62],"永靖市":[103.34, 35.97],"和政市":[103.31, 35.43],"康乐市":[103.68, 35.39],"广河市":[103.54, 35.46],"岷县市":[104.04, 34.41],"积石山市":[102.85, 35.74],"武威市":[102.61, 37.94],"民勤市":[103.08, 38.62],"古浪市":[102.86, 37.43],"景泰市":[104.05, 37.14],"天祝市":[102.84, 37.24],"张掖市":[100.46, 38.93],"民乐市":[100.85, 38.43],"临泽市":[100.17, 39.14],"山丹市":[101.19, 38.79],"高台市":[99.84, 39.14],"肃南市":[99.57, 38.86],"玉门市":[97.58, 39.81],"酒泉市":[98.5, 39.71],"敦煌市":[94.71, 40.13],"金塔市":[98.92, 39.97],"安西市":[95.77, 40.51],"阿克塞市":[94.25, 38.46],"肃北市":[94.89, 39.49],

                    "南宁市":[108.33, 22.84],"柳州市":[109.4, 24.33],"桂林市":[110.28, 25.29],"梧州市":[111.34, 23.51],"凭祥市":[106.75, 22.11],"邕宁市":[108.49, 22.74],"武鸣市":[108.27, 23.17],"马山市":[108.2, 23.73],"上林市":[108.59, 23.44],"宾阳市":[108.8, 23.22],"横县市":[109.2, 22.69],"扶绥市":[107.92, 22.65],"崇左市":[107.37, 22.42],"宁明市":[107.08, 22.12],"龙州市":[106.84, 22.36],"大新市":[107.21, 22.85],"天等市":[107.12, 23.08],"隆安市":[107.68, 23.18],"河池市":[108.06, 24.7],"环江市":[108.26, 24.83],"罗城市":[108.9, 24.79],"宜山市":[108.64, 24.47],"东兰市":[107.36, 24.53],"凤山市":[107.05, 24.55],"天峨市":[107.16, 25.01],"南丹市":[107.54, 24.98],"都安市":[108.09, 23.94],"巴马市":[107.25, 24.15],"合山市":[108.89, 23.82],"柳城市":[109.24, 24.67],"融安市":[109.37, 24.24],"鹿寨市":[109.74, 24.49],"象州市":[109.7, 23.98],"武宜市":[109.66, 23.6],"柳江市":[109.34, 24.27],"来宾市":[109.24, 23.76],"忻城市":[108.66, 24.07],"融水市":[109.24, 25.07],"三江市":[109.58, 25.8],"金秀市":[110.18, 24.14],"临桂市":[110.22, 25.22],"灵川市":[110.33, 25.42],"兴安市":[110.66, 25.6],"资源市":[110.66, 26.03],"全州市":[111.06, 25.96],"灌阳市":[111.14, 25.49],"恭城市":[110.81, 24.85],"平乐市":[110.66, 24.64],"荔浦市":[110.38, 24.51],"永福市":[109.98, 24.99],"龙胜市":[110.02, 25.78],"苍悟市":[111.22, 23.51],"钟山市":[111.3, 24.53],"富川市":[110.26, 24.83],"贺县市":[111.54, 24.44],"岑溪市":[111, 22.95],"藤县市":[110.9, 23.36],"蒙山市":[110.54, 24.22],"昭平市":[110.8, 24.18],"玉林市":[110.14, 22.64],"桂平市":[110.07, 23.38],"平南市":[110.4, 23.55],"容县市":[110.53, 22.87],"北流市":[110.33, 22.71],"陆川市":[110.25, 22.33],"博白市":[109.98, 22.27],"贵县市":[109.6, 23.11],"北海市":[109.12, 21.49],"钦州市":[108.61, 21.96],"灵山市":[109.29, 22.44],"浦北市":[109.56, 22.27],"合浦市":[109.2, 21.33],"上思市":[107.98, 22.16],"防城市":[108.35, 21.78],"百色市":[106.62, 23.91],"凌云市":[106.55, 24.35],"乐业市":[106.56, 24.78],"田阳市":[106.9, 23.75],"田东市":[107.12, 23.62],"平果市":[107.59, 23.33],"德保市":[106.6, 23.34],"靖西市":[106.41, 23.15],"那坡市":[105.85, 23.42],"西林市":[105.08, 24.51],"田林市":[106.24, 24.31],"隆林市":[105.34, 24.8],

                    "乌鲁木齐市":[87.68, 43.77],"克拉玛依市":[84.77, 45.59],"石河子市":[85.94, 44.27],"吐鲁番市":[89.19, 42.91],"托克逊市":[88.63, 42.77],"鄯善市":[90.25, 42.82],"哈密市":[93.44, 42.78],"伊吾市":[94.65, 43.28],"巴里坤市":[93, 43.6],"库尔勒市":[86.06, 41.68],"和静市":[86.35, 42.31],"和硕市":[86.84, 42.23],"博湖市":[86.53, 41.95],"尉梨市":[86.24, 41.36],"轮台市":[84.25, 41.77],"焉耆市":[86.55, 42.05],"和田市":[79.94, 37.12],"民丰市":[82.63, 37.07],"策勒市":[80.78, 37.04],"于田市":[81.63, 36.86],"洛浦市":[80.17, 37.12],"皮山市":[78.29, 37.06],"墨玉市":[79.74, 37.31],"阿克苏市":[80.29, 41.15],"温宿市":[80.24, 41.29],"拜城市":[81.84, 41.82],"库车市":[82.97, 41.68],"新和市":[82.63, 41.55],"沙雅市":[82.9, 41.25],"阿瓦提市":[80.34, 40.64],"柯平市":[79.06, 40.55],"乌什市":[79.25, 41.22],"咯什市":[75.94, 39.52],"巴楚市":[78.59, 39.78],"枷师市":[76.78, 39.46],"乐普湖市":[76.67, 39.23],"麦盖提市":[77.62, 38.95],"莎车市":[77.25, 38.45],"泽普市":[77.26, 38.2],"叶城市":[77.42, 37.89],"疏勒市":[76.05, 39.41],"英吉沙市":[76.17, 38.91],"疏附市":[75.83, 39.42],"塔什库尔干市":[75.22, 75.22],"阿图什市":[76.12, 39.73],"阿合奇市":[78.42, 41.91],"阿克陶市":[75.94, 39.14],"乌恰市":[75.18, 39.7],"昌吉市":[87.31, 44.05],"阜康市":[87.94, 44.14],"奇台市":[89.52, 44.02],"吉木萨尔市":[89.14, 44],"米泉市":[87.68, 43.97],"玛纳斯市":[86.22, 44.28],"呼图壁市":[86.92, 44.18],"木垒市":[90.34, 43.8],"博乐市":[82.1, 44.93],"精河市":[82.92, 44.67],"温泉市":[81.08, 44.95],"伊宁市":[81.33, 43.91],"尼勒克市":[82.53, 43.82],"新源市":[83.27, 43.41],"巩留市":[82.23, 43.35],"奎屯市":[84.89, 44.45],"特克斯市":[81.81, 43.23],"昭苏市":[81.08, 43.15],"霍城市":[80.87, 44.07],"察布察尔市":[81.12, 43.82],"塔城市":[82.96, 46.74],"额敏市":[83.62, 46.52],"乌苏市":[84.62, 44.45],"托里市":[83.59, 45.92],"裕民市":[82.94, 46.21],"沙湾市":[85.56, 44.29],"和布克赛尔市":[85.13, 46.78],"阿勒泰市":[88.14, 47.86],"青河市":[90.37, 46.71],"富蕴市":[89.44, 47.05],"福海市":[87.51, 47.15],"吉木乃市":[85.84, 47.42],"布尔津市":[86.92, 47.7],"哈巴河市":[86.41, 48.05],

                    "呼和浩特市":[111.65, 40.82],"上默特左旗市":[111.13, 40.72],"托克托市":[111.15, 40.28],"包头市":[110, 40.58],"上默特右旗市":[110.52, 40.55],"固阳市":[110.03, 41.03],"乌海市":[106.82, 39.67],"集宁市":[113.08, 41.03],"兴和市":[113.97, 40.88],"清水河市":[111.65, 39.92],"武川市":[111.42, 41.12],"卓资市":[112.52, 40.93],"商都市":[113.53, 41.58],"丰镇市":[113.15, 40.45],"凉城市":[112.48, 40.52],"和林格尔市":[111.8, 40.4],"化德市":[114, 41.9],"察哈尔右翼后旗市":[113.15, 41.85],"察哈尔右翼中旗市":[112.62, 41.28],"察哈尔右翼前旗市":[113.18, 40.78],"四子王旗市":[111.68, 41.37],"达尔罕茂明安联合旗市":[110.42, 41.72],"二连浩特市":[111.96, 43.65],"阿巴哈纳尔旗市":[116.08, 43.95],"多伦市":[116.48, 42.18],"阿巴嘎旗市":[114.97, 44.03],"西乌珠穆沁旗市":[117.58, 44.6],"东乌珠穆沁旗市":[116.97, 45.53],"苏尼特左旗市":[113.7, 43.85],"苏尼特右旗市":[112.95, 42.47],"太仆寺旗市":[115.3, 41.9],"正镶白旗市":[115, 42.32],"正蓝旗市":[116.02, 42.25],"镶黄旗市":[113.83, 42.25],"海拉尔市":[119.73, 29.22],"满洲里市":[117.47, 49.58],"陈巴尔虎旗市":[119.45, 49.33],"额尔古纳右旗市":[120.08, 50.45],"额尔古纳左旗市":[121.52, 50.8],"喜桂图旗市":[120.73, 49.3],"阿荣旗市":[123.5, 48.13],"布特哈旗市":[122.78, 47.98],"新巴尔虎左旗市":[116.82, 48.67],"新巴尔虎右旗市":[118.23, 48.22],"鄂伦春自治旗市":[123.7, 50.58],"莫力达瓦达斡尔族自治旗市":[124.5, 48.47],"鄂温克族自治旗市":[119.75, 49.13],"通辽市":[122.28, 43.63],"开鲁市":[121.32, 43.62],"科尔沁左翼后旗市":[122.35, 42.97],"科尔沁左翼中旗市":[123.28, 44.13],"库伦旗市":[121.75, 42.72],"奈曼旗市":[120.65, 42.85],"扎鲁特旗市":[120.87, 44.55],"赤峰市":[118.87, 42.28],"宁城市":[119.32, 41.62],"林西市":[118.02, 43.62],"喀喇沁旗市":[118.67, 41.95],"敖汉旗市":[119.87, 42.3],"翁牛特旗市":[119, 42.97],"巴林右旗市":[118.65, 43.52],"巴林左旗市":[119.35, 43.98],"阿鲁科尔沁旗市":[120.05, 43.97],"克什克腾旗市":[117.48, 43.28],"伊克昭盟市":[110, 39.83],"东胜县市":[110, 39.83],"准格尔旗市":[111.13, 39.68],"乌审旗市":[109.03, 38.38],"伊金霍洛旗市":[109.77, 39.25],"鄂托克旗市":[107.97, 39.12],"鄂托克前旗市":[107.43, 38.18],"杭锦旗市":[108.7, 39.83],"达拉特旗市":[110.02, 40.42],"临河市":[107.37, 40.78],"五原市":[108.28, 41.12],"磴口市":[106.98, 40.33],"杭锦后旗市":[107.12, 40.88],"乌拉特中旗市":[108.52, 41.55],"乌拉特前旗市":[108.65, 40.75],"乌拉特后旗市":[108.52, 40.88],"阿拉善左旗市":[105.68, 38.85],"阿拉善右旗市":[101.68, 39.2],"额济纳旗市":[100.88, 41.9],"乌兰浩特市":[122.08, 46.07],"突泉市":[121.5, 45.4],"科尔沁右翼前旗市":[122.03, 46.12],"科尔沁右翼中旗市":[121.47, 45.05],

                    "拉萨市":[91.11, 29.97],"林周市":[91.24, 30.2],"当雄市":[91.05, 30.51],"墨竹工卡市":[91.77, 29.77],"尼木市":[90.14, 29.44],"米林市":[94.13, 29.18],"墨脱市":[95.26, 29.22],"达孜市":[91.39, 29.63],"曲水市":[90.7, 29.39],"堆龙德庆市":[90.96, 29.67],"林芝市":[94.25, 29.59],"工布江达市":[93.25, 29.92],"那曲市":[92.1, 31.47],"巴青市":[94.1, 31.96],"比如市":[93.68, 31.53],"班戈市":[90.05, 31.35],"嘉黎市":[93.46, 30.63],"聂荣市":[92.3, 31.08],"索县市":[93.71, 31.92],"安多市":[91.68, 32.29],"申扎市":[88.7, 30.94],"吕都市":[97.14, 31.18],"贡觉市":[98.29, 30.86],"左贡市":[97.9, 29.68],"察隅市":[97.49, 28.62],"洛隆市":[95.76, 30.81],"丁青市":[95.63, 31.42],"波密市":[95.75, 29.92],"江达市":[89.19, 31.53],"察雅市":[97.56, 30.69],"芒康市":[98.68, 29.64],"八宿市":[96.95, 30.04],"边坝市":[94.69, 30.94],"类乌齐市":[96.57, 31.2],"乃东市":[91.76, 29.18],"加查市":[92.6, 29.09],"曲松市":[92.11, 29.08],"错那市":[91.91, 27.98],"穷结市":[91.65, 29.04],"贡嘎市":[90.96, 29.25],"浪卡子市":[90.33, 29.96],"桑日市":[92, 29.26],"朗县市":[93.11, 29.06],"隆子市":[92.42, 28.46],"措美市":[91.4, 28.49],"洛扎市":[90.83, 28.42],"扎囊市":[91.26, 29.22],"日喀则市":[88.82, 29.28],"定结市":[87.77, 28.38],"拉孜市":[87.62, 29.1],"聂拉木市":[85.94, 28.19],"谢通门市":[88.25, 29.43],"仲巴市":[84.15, 29.66],"康马市":[89.67, 28.57],"亚东市":[88.93, 27.55],"岗巴市":[88.5, 28.29],"南木林市":[89.02, 29.71],"萨迦市":[88, 28.87],"定日市":[87.11, 28.57],"吉隆市":[85.29, 28.94],"昂仁市":[87.22, 29.3],"江孜市":[89.63, 28.94],"仁布市":[89.77, 29.21],"白朗市":[89.16, 29.11],"萨嘎市":[85.3, 29.38],"噶尔市":[80, 32.08],"革吉市":[81.13, 32.45],"扎达市":[79.76, 31.47],"措勤市":[85.16, 31.06],"日上市":[79.61, 33.44],"改则市":[84.1, 32.33],"普兰市":[81.18, 30.37],

                    "银川市":[106.27, 38.47],"永宁市":[106.24, 38.28],"贺兰市":[106.35, 38.55],"石嘴山市":[106.39, 39.04],"平罗市":[106.54, 38.91],"陶乐市":[106.69, 38.82],"吴忠市":[106.21, 37.99],"同心市":[105.94, 36.97],"灵武市":[106.34, 38.1],"中宁市":[105.66, 37.48],"盐池市":[107.41, 37.78],"中卫市":[105.18, 37.51],"青铜峡市":[106.07, 38.02],"固原市":[106.28, 36.01],"西吉市":[105.7, 35.97],"泾源市":[106.33, 35.5],"海原市":[105.64, 36.56],"隆德市":[106.11, 35.63],

                    "合肥市":[117.27, 31.86],"长丰市":[117.16, 32.47],"淮南市":[116.98, 32.62],"凤台市":[116.71, 32.68],"淮北市":[116.77, 33.97],"濉溪市":[116.76, 33.92],"芜湖市":[118.38, 31.33],"铜陵市":[117.82, 30.93],"蚌埠市":[117.34, 32.93],"马鞍山市":[118.48, 31.56],"安庆市":[117.03, 30.52],"宿州市":[116.97, 33.63],"宿县市":[116.97, 33.63],"砀山市":[116.34, 34.42],"萧县市":[116.93, 34.19],"吴壁市":[117.55, 33.55],"泗县市":[117.89, 33.49],"五河市":[117.87, 33.14],"固镇市":[117.32, 33.33],"怀远市":[117.19, 32.95],"滁州市":[118.31, 32.33],"嘉山市":[117.98, 32.78],"天长市":[119, 32.68],"来安市":[118.44, 32.44],"全椒市":[118.27, 32.1],"定远市":[117.68, 32.52],"凤阳市":[117.4, 32.86],"巢湖市":[117.87, 31.62],"巢县市":[117.87, 31.62],"肥东市":[117.47, 31.89],"含山市":[118.11, 31.7],"和县市":[118.37, 31.7],"无为市":[117.75, 31.3],"卢江市":[117.29, 31.23],"宣城市":[118.73, 31.95],"当涂市":[118.49, 31.55],"郎溪市":[119.17, 31.14],"广德市":[119.41, 30.89],"泾县市":[118.41, 30.68],"南陵市":[118.32, 30.91],"繁昌市":[118.21, 31.07],"宁国市":[118.95, 30.62],"青阳市":[117.84, 30.64],"屯溪市":[118.31, 29.72],"休宁市":[118.19, 29.81],"旌得市":[118.53, 30.28],"绩溪市":[118.57, 30.07],"歙县市":[118.44, 29.88],"祁门市":[117.7, 29.86],"黟县市":[117.92, 29.93],"太平市":[118.13, 30.28],"石台市":[117.48, 30.19],"桐城市":[116.94, 31.04],"纵阳市":[117.21, 30.69],"怀宁市":[116.63, 30.41],"望江市":[116.69, 30.12],"宿松市":[116.13, 30.15],"太湖市":[116.27, 30.42],"岳西市":[116.36, 30.84],"潜山市":[116.53, 30.62],"东至市":[116.99, 30.08],"贵池市":[117.48, 30.66],"六安市":[116.49, 31.73],"霍丘市":[116.27, 32.32],"寿县市":[116.78, 32.57],"肥西市":[117.15, 31.7],"舒城市":[116.94, 31.45],"霍山市":[116.32, 31.38],"金寨市":[115.87, 31.67],"阜阳市":[115.81, 32.89],"毫县市":[116.76, 33.86],"涡阳市":[116.21, 33.49],"蒙城市":[116.55, 33.25],"利辛市":[116.19, 33.12],"颖上市":[116.26, 32.62],"阜南市":[115.6, 32.63],"临泉市":[115.24, 33.06],"界首市":[115.34, 33.24],"太和市":[115.61, 33.16],

                    "南京市":[118.78, 32.04],"江宁市":[118.83, 31.95],"六合市":[118.83, 32.36],"江浦市":[118.62, 32.07],"徐州市":[117.2, 34.26],"连云港市":[119.16, 34.59],"苏州市":[120.62, 31.32],"无锡市":[120.29, 31.59],"常州市":[119.95, 31.79],"丰县市":[116.57, 34.79],"沛县市":[116.93, 34.73],"赣榆市":[119.11, 34.83],"东海市":[118.75, 34.54],"新沂市":[118.33, 34.38],"邳县市":[117.97, 34.3],"睢宁市":[117.94, 33.89],"铜山市":[117.2, 34.26],"清江市":[119.02, 33.59],"灌云市":[119.23, 34.3],"灌南市":[119.36, 34.09],"沭阳市":[118.79, 34.12],"宿迁市":[118.3, 33.96],"泗阳市":[118.68, 33.73],"盱眙市":[118.05, 33],"涟水市":[119.26, 33.77],"淮阴市":[119.02, 33.62],"淮安市":[119.15, 33.5],"洪泽市":[118.85, 33.28],"泗洪市":[118.23, 33.46],"金湖市":[119.02, 33.01],"盐城市":[120.13, 33.38],"滨海市":[119.84, 34.01],"阜宁市":[119.79, 33.78],"射阳市":[120.26, 33.77],"建湖市":[119.77, 33.46],"响水市":[119.56, 34.2],"大丰市":[120.45, 33.19],"东台市":[120.31, 32.84],"海安市":[120.45, 32.57],"如皋市":[120.56, 32.39],"如东市":[121.18, 32.33],"启东市":[121.66, 31.8],"海门市":[121.15, 31.89],"南通市":[121.05, 32.08],"扬州市":[119.42, 32.39],"宝应市":[119.32, 33.23],"兴化市":[119.82, 32.93],"高邮市":[119.45, 32.78],"泰兴市":[120.02, 32.16],"泰县市":[120.15, 32.51],"泰州市":[119.9, 32.49],"靖江市":[120.26, 32.03],"江都市":[119.55, 32.43],"邗江市":[119.42, 32.39],"仪征市":[119.16, 32.27],"镇江市":[119.44, 32.2],"丹徒市":[119.44, 32.2],"扬中市":[119.81, 32.24],"丹阳市":[119.55, 32],"武进市":[119.95, 31.78],"宜兴市":[119.82, 31.36],"金坛市":[119.56, 31.74],"溧阳市":[119.48, 31.43],"句容市":[119.16, 31.95],"溧水市":[119.02, 31.65],"高淳市":[118.87, 31.32],"江阴市":[120.26, 31.91],"沙洲市":[120.55, 31.86],"常熟市":[120.74, 31.64],"太仓市":[121.1, 31.45],"昆山市":[120.95, 31.39],"吴县市":[120.62, 31.32],"吴江市":[120.63, 31.16]


                }


                //设置不同level的颜色
                var levelColorMap = {
                    '1': 'rgba(241, 109, 115, .8)',
                    '2': 'rgba(255, 235, 59, .7)',
                    '3': 'rgba(147, 235, 248, 1)'
                };

                var defaultOpt = {
                    mapName: 'china',     // 地图展示
                    goDown: false,        // 是否下钻
                    bgColor: '#404a59',   // 画布背景色
                    activeArea: [],       // 区域高亮,同echarts配置项
                    // 下钻回调(点击的地图名、实例对象option、实例对象)
                    callback: function(name, option, instance){}
                };
                if(opt) opt = this.util.extend(defaultOpt, opt);
                // 层级索引
                //地图的名字
                var name = [opt.mapName];
                var idx = 0;
                var pos = {
                    leftPlus: 115,
                    leftCur: 150,
                    left: 198,
                    top: 50
                };
                var line = [[0, 0], [8, 11], [0, 22]];
                // style
                var style = {
                    font: '18px "Microsoft YaHei", sans-serif',
                    textColor: '#eee',
                    lineColor: 'rgba(147, 235, 248, .8)'
                };
                //处理事件
                var handleEvents = {
                    /**
                     * i 实例对象
                     * o option
                     * n 地图名
                     **/
                    resetOption: function(i, o, n){
                        //根据这个地图名创建一个breadcrumb导航
                        var breadcrumb = this.createBreadcrumb(n);
                        //这个地图名第一次出现的位置
                        //name 地图名 -> 中国
                        var j = name.indexOf(n);
                        var l = o.graphic.length;
                        if(j < 0){
                            //和name的值不一样，添加都dao graphic
                            o.graphic.push(breadcrumb);
                            o.graphic[0].children[0].shape.x2 = 145;
                            o.graphic[0].children[1].shape.x2 = 145;
                            // if(o.graphic.length > 2){
                            //     for(var x = 0; x < opt.data.length; x++){
                            //         if(n === opt.data[x].name){
                            //             o.series[0].data = handleEvents.initSeriesData([opt.data[x]]);
                            //             break;
                            //         }else o.series[0].data = [];
                            //     }
                            // };
                            o.series[0].data = handleEvents.initSeriesData(opt.data);
                            name.push(n);
                            idx++;
                        }else{
                            //Array.splice(start: number,deleteCount?: number): T[]
                            // Removes elements from an array and, if necessary, inserts new elements in their place,
                            // returning the deleted elements.
                            //     Params:
                            // start – The zero-based location in the array from which to start removing elements.
                            // deleteCount – The number of elements to remove
                            //将多余的删除
                            o.graphic.splice(j + 2, l);
                            if(o.graphic.length <= 2){
                                o.graphic[0].children[0].shape.x2 = 60;
                                o.graphic[0].children[1].shape.x2 = 60;
                                o.series[0].data = handleEvents.initSeriesData(opt.data);
                            };
                            name.splice(j + 1, l);
                            idx = j;
                            pos.leftCur -= pos.leftPlus * (l - j - 1);
                        };
                        o.geo.map = n;
                        o.geo.zoom = 1;
                        i.clear();
                        i.setOption(o);
                        //this.zoomAnimation();
                        opt.callback(n, o, i);
                    },
                    /**
                     * name 地图名
                     * 创建面包屑
                     **/
                    createBreadcrumb: function(name){
                        var cityToPinyin = {
                            "安徽省": "anhui",
                            "澳门": "aomen",
                            "北京市": "beijing",
                            "重庆市": "chongqing",
                            "福建省": "fujian",
                            "甘肃省": "gansu",
                            "广东省": "guangdong",
                            "广西壮族自治区": "guangxi",
                            "贵州省": "guizhou",
                            "海南省": "hainan",
                            "黑龙江":"heilongjiang",
                            "河南省": "henan",
                            "湖北省": "hubei",
                            "湖南省": "hunan",
                            "江苏省": "jiangsu",
                            "江西省": "jiangxi",
                            "吉林省": "jilin",
                            "辽宁省": "liaoning",
                            "内蒙古自治区":"neimenggu",
                            "宁夏回族自治区": "ningxia",
                            "青海省": "qinghai",
                            "山东省": "shandong",
                            "陕西省": "shanxi",
                            "山西省": "shanxi",
                            "四川省": "sichuan",
                            "天津市": "tianjin",
                            "香港": "xianggang",
                            "新疆维吾尔自治区": "xinjiang",
                            "西藏自治区": "xizang",
                            "云南省": "yunnan",
                            "浙江省": "zhejiang",
                            "上海市": "shanghai",
                            "河北省": "hebei"
                        };
                        //面包屑导航是一个 json 数组
                        var breadcrumb = {
                            type: 'group',
                            id: name,
                            left: pos.leftCur + pos.leftPlus,
                            top: pos.top + 3,
                            children: [{
                                type: 'polyline',
                                left: -90,
                                top: -5,
                                shape: {
                                    points: line
                                },
                                style: {
                                    stroke: '#fff',
                                    key: name
                                    // lineWidth: 2,
                                },
                                onclick: function(){
                                    var name = this.style.key;
                                    handleEvents.resetOption(chart, option, name);
                                }
                            }, {
                                //显示的地图名
                                type: 'text',
                                left: -68,
                                top: 'middle',
                                style: {
                                    text: name,
                                    textAlign: 'center',
                                    fill: style.textColor,
                                    font: style.font
                                },
                                onclick: function(){
                                    var name = this.style.text;
                                    handleEvents.resetOption(chart, option, name);
                                }
                            }, {
                                //显示的地图拼音大写
                                type: 'text',
                                left: -68,
                                top: 10,
                                style: {
                                    name: name,
                                    text: cityToPinyin[name] ? cityToPinyin[name].toUpperCase() : '',
                                    textAlign: 'center',
                                    fill: style.textColor,
                                    font: '12px "Microsoft YaHei", sans-serif',
                                },
                                onclick: function(){
                                    // console.log(this.style);
                                    var name = this.style.name;
                                    handleEvents.resetOption(chart, option, name);
                                }
                            }]
                        }
                        pos.leftCur += pos.leftPlus;
                        return breadcrumb;
                    },
                    // 设置effectscatter
                    initSeriesData: function(data){
                        var temp = [];
                        for(var i = 0;i < data.length;i++){
                            var geoCoord = geoCoordMap[data[i].name];
                            if(geoCoord){
                                temp.push({
                                    name: data[i].name,
                                    // value: data[i].value
                                    //  地理位置的坐标数组 连接到 地理位置对应的值
                                    value: geoCoord.concat(data[i].value)
                                });
                            }
                        };
                        return temp;
                    },
                    /*zoomAnimation: function(){
                        var count = null;
                        var zoom = function(per){
                            if(!count) count = per;
                            count = count + per;
                            // console.log(per,count);
                            chart.setOption({
                                geo: {
                                    zoom: count
                                }
                            });
                            if(count < 1) window.requestAnimationFrame(function(){
                                zoom(0.2);
                            });
                        };
                        window.requestAnimationFrame(function(){
                            zoom(0.2);
                        });
                    }*/
                };
                var option = {
                    backgroundColor: opt.bgColor,
                    //地理位置
                    graphic: [{
                        type: 'group',
                        left: pos.left,
                        top: pos.top - 4,
                        children: [{
                            type: 'line',
                            left: 0,
                            top: -20,
                            shape: {
                                x1: 0,
                                y1: 0,
                                x2: 60,
                                y2: 0
                            },
                            style: {
                                stroke: style.lineColor,
                            }
                        }, {
                            type: 'line',
                            left: 0,
                            top: 20,
                            shape: {
                                x1: 0,
                                y1: 0,
                                x2: 60,
                                y2: 0
                            },
                            style: {
                                stroke: style.lineColor,
                            }
                        }]
                    }, {
                        id: name[idx],
                        type: 'group',
                        left: pos.left + 2,
                        top: pos.top,
                        children: [{
                            type: 'polyline',
                            left: 90,
                            top: -12,
                            shape: {
                                points: line
                            },
                            style: {
                                stroke: 'transparent',
                                key: name[0]
                            },
                            onclick: function(){
                                //key  也是  name   中国
                                var name = this.style.key;
                                opt.data = dd;
                                if(name.length = 1){
                                    $('#table1').bootstrapTable('refresh',{url:'<%=request.getContextPath()%>/provinceUserInfo'});
                                }

                                handleEvents.resetOption(chart, option, name);
                            }
                        }, {
                            type: 'text',
                            left: 0,
                            top: 'middle',
                            style: {
                                text: name[0] === '中国' ? '中国' : name[0],
                                textAlign: 'center',
                                fill: style.textColor,
                                font: style.font
                            },
                            onclick: function(){
                                opt.data = dd;
                                if(name.length = 1){
                                    $('#table1').bootstrapTable('refresh',{url:'<%=request.getContextPath()%>/provinceUserInfo'});
                                }
                                handleEvents.resetOption(chart, option, '中国');
                            }
                        }, {
                            type: 'text',
                            left: 0,
                            top: 10,
                            style: {
                                text: 'ZHONGGUO',
                                textAlign: 'center',
                                fill: style.textColor,
                                font: '12px "Microsoft YaHei", sans-serif',
                            },
                            onclick: function(){
                                opt.data = dd;
                                if(name.length = 1){
                                    $('#table1').bootstrapTable('refresh',
                                        {url:'<%=request.getContextPath()%>/provinceUserInfo'});
                                }
                                handleEvents.resetOption(chart, option, '中国');
                            }
                        }]
                    }],
                    geo: {
                        map: opt.mapName,
                        // roam: true,
                        zoom: 1,
                        label: {
                            normal: {
                                show: true,
                                textStyle: {
                                    color: '#fff'
                                }
                            },
                            emphasis: {
                                textStyle: {
                                    color: '#fff'
                                }
                            }
                        },
                        itemStyle: {
                            normal: {
                                borderColor: 'rgba(147, 235, 248, 1)',
                                borderWidth: 1,
                                areaColor: {
                                    type: 'radial',
                                    x: 0.5,
                                    y: 0.5,
                                    r: 0.8,
                                    colorStops: [{
                                        offset: 0,
                                        color: 'rgba(147, 235, 248, 0)' // 0% 处的颜色
                                    }, {
                                        offset: 1,
                                        color: 'rgba(147, 235, 248, .2)' // 100% 处的颜色
                                    }],
                                    globalCoord: false // 缺省为 false
                                },
                                shadowColor: 'rgba(128, 217, 248, 1)',
                                // shadowColor: 'rgba(255, 255, 255, 1)',
                                shadowOffsetX: -2,
                                shadowOffsetY: 2,
                                shadowBlur: 10
                            },
                            emphasis: {
                                areaColor: '#389BB7',
                                borderWidth: 0
                            }
                        },
                        regions: opt.activeArea.map(function(item){
                            if(typeof item !== 'string'){
                                return {
                                    name: item.name,
                                    itemStyle: {
                                        normal: {
                                            areaColor: item.areaColor || '#389BB7'
                                        }
                                    },
                                    label: {
                                        normal: {
                                            show: item.showLabel,
                                            textStyle: {
                                                color: '#fff'
                                            }
                                        }
                                    }
                                }
                            }else{
                                return {
                                    name: item,
                                    itemStyle: {
                                        normal: {
                                            borderColor: '#91e6ff',
                                            areaColor: '#389BB7'
                                        }
                                    }
                                }
                            }
                        }),
                        nameMap:{

                        }
                    },
                    visualMap:[{
                        min: 0,
                        max: 1000,
                        text:['High','Low'],
                        // color: ['orangered','yellow','lightskyblue']
                        realtime: false,
                        calculable: true,
                        inRange: {
                            color: ['lightskyblue','orange', 'orangered']
                        }
                    }],
                    tooltip:{
                        show: true,
                        trigger: 'item',
                        formatter: function(params){
                            return (params.value)[2];
                        }
                    },
                    series: [{
                        type: 'effectScatter',
                        // type: 'map',
                        coordinateSystem: 'geo',
                        // symbol: 'diamond',
                        showEffectOn: 'render',
                        rippleEffect: {
                            period: 15,
                            scale: 1,
                            // brushType: 'fill'
                            brushType: 'stroke'
                        },
                        hoverAnimation: true,
                        itemStyle: {
                            normal: {
                                color: function(params){
                                    return levelColorMap[params.value[3]];
                                },
                                shadowBlur: 10,
                                shadowColor: '#333'
                            }
                        },
                        label: {
                            normal: {
                                formatter: function(params){
                                    return (params.value)[2];
                                },
                                position: 'right',
                                // show: true
                                // color: '#000'
                            }
                        },

                        data: handleEvents.initSeriesData(opt.data)
                    }]
                };
                chart.setOption(option);
                // 添加事件
                chart.on('click', function(params){
                    $.ajax({
                        type:"post",
                        url:"${pageContext.request.contextPath}/cityusersinprovince",
                        data:"provinceName="+params.name,
                        async:false,
                        dataType:'json',
                        processType:true,
                        success: function(data) {
                            // console.log(data);
                             opt.data = data;
                        }
                    })

                    // 刷新表格数据
                    // initTable(params.name);
                    if (name.length == 1) {
                        $('#table1').bootstrapTable('refresh', {url: '<%=request.getContextPath()%>/cityusersTable?provinceName=' + params.name});
                    }
                    var _self = this;
                    if(opt.goDown && params.name !== name[idx]){
                        if(cityMap[params.name]){
                            var url = cityMap[params.name];
                            $.get(url, function(response){
                                curGeoJson = response;
                                echarts.registerMap(params.name, response);
                                handleEvents.resetOption(_self, option, params.name);
                            });
                        }
                    }
                });
                return chart;
            };

            //获取省份信息
            var dd = [];
            $.ajax({
                url: "${pageContext.request.contextPath}/provinceuser",
                dataType:'json',
                processType:true,
                async: false,
                success: function(data) {
                    dd = data;
                }
            });

            //  获取中国地图json
            $.getJSON(china, function(geoJson){



                //获取地区json，，之后向echarts注册
                echarts.registerMap('中国', geoJson);
                // chart-panel 是一个div的id名
                echarts.extendsMap('id', {
                    bgColor: '#154e90', // 画布背景色
                    mapName: '中国',    // 地图名
                    goDown: true,       // 是否下钻
                    // 数据展示
                    data: dd

                });
            })
        }

        // 初始化表格
        function initTable() {
            <%--var url = '<%=request.getContextPath()%>/provinceUserInfo'--%>
            <%--if (location !== 'all'){--%>
                <%--url = '<%=request.getContextPath()%>/cityusersTable?provinceName='+location--%>
            <%--}--%>

            $("#table1").bootstrapTable({ // 对应table标签的id
                url: '<%=request.getContextPath()%>/provinceUserInfo', // 获取表格数据的url
                cache: false, // 设置为 false 禁用 AJAX 数据缓存， 默认为true
                striped: true,  //表格显示条纹，默认为false
                showRefresh:true,
                toolbar: '#toolbar',
                showColumns:true,
                // queryParamsType:'limit',
                showFooter:true,
                classes:'table table-hover',
                showToggle:true,
                search:true,
                pagination: true, // 在表格底部显示分页组件，默认false
                pageList: [5,10,15], // 设置页面可以显示的数据条数
                pageSize: 5, // 页面数据条数
                pageNumber: 1, // 首页页码
                sidePagination: 'client', // 设置为服务器端分页
                queryParams: function (params) { // 请求服务器数据时发送的参数，可以在这里添加额外的查询参数，返回false则终止请求

                    return {
                        limit: params.limit,
                        offset: (params.offset/params.limit)+1
                    }
                },
                sortName: 'num', // 要排序的字段
                sortOrder: 'desc', // 排序规则
                columns: [
                    {
                        checkbox: true, // 显示一个勾选框
                        align: 'center' // 居中显示
                    }, {
                        field: 'areaName', // 返回json数据中的name
                        title: '地区', // 表格表头显示文字
                        align: 'center', // 左右居中
                        valign: 'middle' // 上下居中
                    }, {
                        field: 'num',
                        title: '数量',
                        align: 'center',
                        valign: 'middle'
                    }, {
                        field: 'percent',
                        title: '百分比',
                        align: 'center',
                        valign: 'middle'
                    }
                ],
                responseHandler: function(data){
                    return data.rows;
                },
                onLoadSuccess: function(data){  //加载成功时执行
                    console.log(data);
                    console.info("加载成功");
                },
                onLoadError: function(){  //加载失败时执行
                    console.info("加载数据失败");
                }

            });







        }



    </script>
</body>
</html>
